[
  {
    "text": "Hi <@UGEFWGTH7>, I hope you are doing well.\n\nCurrently, I'm looking for 100% remote job.\nIf you need liked this, please let me know.\n\nI am a full-stack developer who is looking for a client who can work with me in a long term relationship,\n\nI am hungry with a job and wanted to ask you if you can help me out.\nI am looking for a client whom I can dedicate my full-time work as a long term relationship.\n\nI have got hands-on experience of turning startups into success before.\n\nSpecialties: PHP(CI, YII, Laravel) framework, Ruby/ROR, MERN stack [MongoDB, Express, React, Node.js], MEAN stack [Angular], Shopify, Swift, React Native, Wordpress, Python/Django, Magento, Opencart, DebOps(AWS), GraphQL\n\nMy work time is from Monday to Friday (can work on client timezone, flexible)\nPlease send me the invitation link for the interview.\n\nLooking forward to hearing from you soon.\nRegards,\nJack\n\nFYI, phone: <tel:+14353639282|+1 435 363 9282>\nrate: $45/h but flexible\n<https://fullstack412.github.io/jacklin-resume/>\n<https://github.com/fullstack412/>",
    "label": "3"
  },
  {
    "text": "Hey! Here at Funding Circle, we're looking for DevOps engineers to join our team in London and the US!\n\nYou can find full details on this link and if you have any questions, please feel free to reach out to me directly!\n\nUS :us: <https://www.fundingcircle.com/us/about/careers/?p=job%2FoAKRbfw6>\nUK :uk: <https://jobs.jobvite.com/careers/funding-circle-uk/job/okKRbfwQ?__jvst=Career+Site>",
    "label": "1"
  },
  {
    "text": "I'm looking for a front end dev to collaborate with. If you are interested in this. Git me up",
    "label": "1"
  },
  {
    "text": "Morning All, we have a fantastic opening for a Product Manager role here at Mitrefinch. A recent Glassdoor review referred to us as a “40-year-old start up” – and we’re proud of that! Even though we’ve been around for a while we’re always innovating and growing our specialist workforce management solutions – from fingerprint entry to payroll software – we’ve got it covered; and we have no intention of taking our finger off the pulse!\nBased in Nottingham and York with operations in Canada and Australia, we offer our employees great benefits, an amazing company culture and environment – just check out our offices!\nWe have ambitious plans for the future and we’re on the lookout for outstanding people to join our already amazing team. If your interested, please apply here <https://www.mitrefinch.co.uk/jobs/product-manager/>",
    "label": "1"
  },
  {
    "text": "HERE solutions is looking for a Senior Product Owner in Berlin . Please find the JD <https://careers-here.icims.com/jobs/55708/sr-product-owner---developer-portal-%28m-f-x%29/job|https://careers-here.icims.com/jobs/55708/sr-product-owner---developer-portal-%28m-f-x%29/job> \n\nPls message me if you are interested.",
    "label": "1"
  },
  {
    "text": "&gt; No degree, no problem: More than half (54%) of engineers say if they were a hiring manager they would have no preference between a candidate with or without a computer science degree.",
    "label": "3"
  },
  {
    "text": "Bon día!\n<https://hired.com/page/state-of-software-engineers/|https://hired.com/page/state-of-software-engineers/>",
    "label": "2"
  },
  {
    "text": "Hi all! I'm a product-minded software engineer (mostly front-end) based in Pécs, Hungary. I've been doing this professionally for about a decade, fully remote for about 8 years. Mostly working with western European and US companies. Currently working full-time at an early stage healthy tech startup. I love working with startups like these, as there are opportunities to wear many hats which suits me well and keeps things interesting. This year I'm hoping to learn more about AWS and product design. Outside of work I'm a mechanical keyboard and car nerd. Looking forward to be a part of this community! Bálint",
    "label": "3"
  },
  {
    "text": "btw in terms of getting past keyword filters, and the technical interviewer being willing to overlook some mismatch in those keywords as long as you demonstrate a readiness to learn tools as needed, the same generally applies to a lot of things. at a beginner level, learning a whole new language may be a big obstacle, but after mastery of basic programming and some real world dev experience, it's generally considered not a huge deal to learn a new language or framework, and you can approach job hunting accordingly. most jobs will want you to already have the core technical skills involved but the rest may often be optional, things you can learn on the job as part of the onboarding process.",
    "label": "3"
  },
  {
    "text": "Thanks! I am already working through Brave and True. I was looking for resources more specific to the webdev ecosystem in Clojure.",
    "label": "3"
  },
  {
    "text": "Hi :wave: I'm previously solo founder of <http://lipreading.org|lipreading.org> (successful bootstrap, largest site for hard of hearing to learn how to lipread), and VP of engineering at <http://gyant.com|gyant.com> (medical AI startup in SF). I'm currently looking to co-found the next thing, and I'm specifically looking for a marketing/PM cofounder to ideate with, for reach &amp; audience -I can take care of all tech/corp/legal/accounting side. I'm specifically interested in currently underserved niches, focusing on maximizing probability of success, and cashflow (as opposed to traditional VC-funded startups); with the outcome of creating cashflow-positive, dividend-paying income streams. If this sounds interesting, let's chat. Intros very welcome, thanks!",
    "label": "1"
  },
  {
    "text": "Hey everyone, we are Xplor (<http://ourxplor.com|ourxplor.com>), we are building child care software and changing education. We are expanding globally and are looking for multiple roles: iOS, Android, PHP and DevOps… Please check us out, and ping me if you have any questions. :slightly_smiling_face:\n\n<https://apply.workable.com/xplor/>",
    "label": "2"
  },
  {
    "text": "My remote engineering group at Plaid is hiring full stack developers (and EMs!) from PST to CET. Our goal is to build the tools and infrastructure for developers to create this next generation of financial services applications, and the direct to consumer experiences that earn user trust in our ecosystem. Our stack is Golang backend, React front end. If you are interested, please apply at <https://plaid.com/careers/openings/?department=Engineering&amp;location=Remote> Thank you!",
    "label": "1"
  },
  {
    "text": "i have finally escaped my legacy software administrator position (peoplesoft) and acquired an aws engineer role!",
    "label": "3"
  },
  {
    "text": "Hey, peeps! My team at Piktochart is hiring for a Talent Development Manager at Piktochart! If you're passionate and hopeful about investing into people and developing our team for the future, we'd love to hear from you. \n\nThis is a fully remote role in either Asia or Europe. Find out more and apply here: <https://grnh.se/f60933991>",
    "label": "1"
  },
  {
    "text": "Curious, I may just be searching for the wrong thing. I see the ability to connect a GitHub repository to Azure DevOps project, for the purpose of having actions taken in issues and PR on GitHub to trigger Azure DevOps Pipelines and processes. If I have (as a vendor) repositories on GitHub for public access to the code, will it be possible for me to keep those in sync with a private copy of that repository in Azure DevOps (minus git history I'd assume)?",
    "label": "3"
  },
  {
    "text": "this looks like react dev tools stuff maybe?",
    "label": "3"
  },
  {
    "text": "FraudScope - An AI-assisted Platform for Detecting Healthcare Fraud &amp; Waste startup is currently looking for an AWS DevOps Engineer. Its a full time position located in Tech Square, Midtown Atlanta. More detail about this position on: <https://app.trinethire.com/companies/5502-fraudscope/jobs/23638-devops-engineer>\n**No visa sponsorship",
    "label": "2"
  },
  {
    "text": "Next Tuesday (March 3rd) I'll be talking at the Pre-coders meetup about what an IDE is and how to use it.\n\nIf you know anyone looking to get into development, send um this link:\n\n<https://www.meetup.com/Denver-Pre-Coders-Meetup/events/nvlzrlybcfbfb/>",
    "label": "3"
  },
  {
    "text": "Hi all! :wave:  We’re building out our product team in Boulder — Looking forward to meeting some of you in person at dev meetups!  If you know of any engineers interested in a joining an early-stage startup, we have a few roles open: <https://cloudcampaign.io/about>",
    "label": "2"
  },
  {
    "text": "I posted a quick thing this on Twitter, but I figure a few other folks might be interested in seeing this here as well. So we’re currently working on a game that makes extensive use of full motion video. Specifically, green-screened puppets.\n\nAs part of the game we wanted to layer some interaction on top of the video, which requires some kind of tracking the position of in-video objects and translating that position into Unity’s world space. We’re a team of 2 dealing with potentially hours of video, so I had to develop a fully automated process for doing so. Normally in special FX work, there’s a partially automated process using trackers that then gets cleaned up with manual rotoscoping if needed.\n\nI started out by finding general object tracking tutorials and found this one here (<https://www.pyimagesearch.com/2015/09/14/ball-tracking-with-opencv/>). This gave me most of the base code I needed, and the next step was just to tweak the color range and tracking to the source video I was working with. In our case, we were already using green for the background, so our tracking object was blue. Once I had that down, I exported the position data with timestamps to a binary file and set up the the corresponding read and position code in unity to align the positions with the video rendered in Unity. Here’s what it looks like on the opencv side:",
    "label": "3"
  },
  {
    "text": "Hey all,\nAre there any known issues on FTL, emulated device (NexusLowRes), related to internet speed issues? I'm noticing tests that pass consistently locally are failing server-side. The videos just look like everything is taking a really long time to load. (e.g. loading images takes 30 seconds, logging in takes 1 minute)",
    "label": "3"
  },
  {
    "text": "Hey All! <http://Clubhouse.io|Clubhouse.io> is ACTIVELY INTERVIEWING for Full-Time Remote Clojure Engineers. All applicants MUST BE USA BASED. Please email me directly at <mailto:HEATHER.MORRIS@CLUBHOUSE.IO|HEATHER.MORRIS@CLUBHOUSE.IO> for immediate consideration. Thanks all! Looking forward to speaking with you!\n\n<https://boards.greenhouse.io/clubhousesoftware/jobs/4224771002>",
    "label": "2"
  },
  {
    "text": "Hello Devs of Denver! I am a full stack developer with Team Lead experience. I have started looking for positons in Denver so I can be a bit closer to family in Kansas, currently in Eugene Oregon.\nLets connect on <https://www.linkedin.com/in/prestonburton/|LinkedIn> or you can checkout my <http://www.prestonburton.dev|portfolio>.  I am excited to see the tech side of Colorado.",
    "label": "2"
  },
  {
    "text": "you may be able to look at their overall coursework and base a self-guided study from what you find interesting - the online 1 day course does have a cost associated with it (~$675) but just to note, this course is not really intended for developers, more for folks who are working with developers from sales, strategy, or project management roles to get a good overview of what AWS offers",
    "label": "3"
  },
  {
    "text": "<@U9Q8YBH54> Yep, I'm looking for a roadmap for learning cloud tech. Seems like definition for web developer has expanded once more. The only cloud hosting I'm familiar with is signing up for a remote Apache shared or reseller hosting for $x.99 per month",
    "label": "3"
  },
  {
    "text": "Hi! I'm looking for a Lead UX Designer to join our small team in Arlington, VA. DM me with any questions. Thanks! <https://apply.workable.com/blue-raster/j/A60B622880/>",
    "label": "1"
  },
  {
    "text": "Hey everyone. I'm Mat, Head of Smart Cities at <https://www.iota.org/|the IOTA Foundation>. I look forward to learning more  with everyone here on Product Management and Development. Feel free to reach out to connect via <https://www.linkedin.com/in/mathewyarger/|LinkedIn>!",
    "label": "2"
  },
  {
    "text": "but this is, I think, a culture mismatch between perhaps the often-java-world-veteran Clojure dev and the new kids on the block. for folks who toiled through Java looking up a dep on the web is trivial, and an annoyance for folks who've cut their teeth on js.",
    "label": "3"
  },
  {
    "text": "A lot of JVM folks look at the npm world with horror over how cavalier JS devs seem to be about stability :slightly_smiling_face:",
    "label": "3"
  },
  {
    "text": "Hi guys, I'm looking for a part-time developer with a great experience in developing large scaling apps. We are building a new generation social network. If you're interested to challenge yourself, please DM me.\n\nP.S.: we pay $20-$30/h\n\nalso you always can reach me in telegram: @appbak3r",
    "label": "1"
  },
  {
    "text": "One of my clients, Parsyl, is looking for two full-time Product Designers, as well as two Product Managers and many other roles too. I contract with them on the Design side and they’ve been really great to work with. Parsyl’s devices track sensitive shipments like vaccines and food to give data on what happened during the shipping process to make sure it is viable upon arrival. They’re based in Denver, but probably open to all situations. <https://www.parsyl.com/careers>",
    "label": "1"
  },
  {
    "text": "Hi everyone.  I have 4 open positions for web engineers and QA working on Food Network (specifically the Food Network Kitchen product) at Discovery in Knoxville.  Frontend and full-stack at all experience levels, using a lot of React and javascript in general.  It's a great office, great benefits, and a rapidly growing part of the company. I'm the actual hiring manager for these roles and not a recruiter so please reach out with any questions you have.\n\nSoftware Development Engineer I, web: <https://careers-discovery.icims.com/jobs/26015/sde-i%2c-web/job?hub=12> (2 spots available)\nSoftware Development Engineer II, web: <https://careers-discovery.icims.com/jobs/26015/sde-i%2c-web/job?hub=12>  (1 spot - this job description will be replaced with a more senior one soon)\nQA Engineer I, web: <https://careers-discovery.icims.com/jobs/26014/sde-i%2c-qa-web/job?hub=12>",
    "label": "1"
  },
  {
    "text": "It looks like a mechanism our service uses to log into google accounts on the devices stopped working temporarily. If it keeps happening, let us know and we can dig deeper, but it looks like your tests have been running normally since. Also, if you don't need to be logged in to Google accounts to run your tests, you can disable it in gcloud with `--no-auto-google-login`",
    "label": "3"
  },
  {
    "text": "99% of the jobs I've had for the last ~13 years have always been product/design positions that I somehow end up getting roped into being a developer.",
    "label": "3"
  },
  {
    "text": "We are hiring Sr Product Designers  with 2-5 years of product design experience on complex products, ideally web/B2B and Experience conducting interview-driven user research - email me your resume to <mailto:mark@terminal.io|mark@terminal.io>",
    "label": "1"
  },
  {
    "text": "Hey everyone, my name is Shaun Kreider. I'm a graphic designer and illustrator with over 10 years of experience, mostly in sports. Looking for a new adventure and full time job. Excited to meet you all.",
    "label": "2"
  },
  {
    "text": "We are looking to hire cloud engineers at Cengage in Boston.  If you are interested please submit an application.\nWe are an educational content, technology, and services company for the higher education, K-12, professional, and library markets.  Our primary market is US, but we have a growing international market and operate in over 20 countries.\nSalary range is 115-130k, flexible work arrangements are acceptable.    Please DM me if you'd like to discuss.\n<https://careers-cengage.icims.com/jobs/8479/sr.-cloudops-engineer/job>",
    "label": "1"
  },
  {
    "text": "Slingshot is looking for a frontend dev with some React chops. We're a full-remote company but a few of the devs live in Utah County so they're getting a small office down there that you would be welcome to go into (I will not be one of them). Equity is also potentially available. I don't think we have it posted anywhere so DM me if you're interested.",
    "label": "1"
  },
  {
    "text": "most of our hiring will be product managers and devs",
    "label": "3"
  },
  {
    "text": "If I was in your position I would hire as MANY talented IT engineers as possible with experience scaling a business",
    "label": "3"
  },
  {
    "text": "A close relationship with our equipment vendor, primarily CDW at the time. We also had a dedicated IT Inventory employee whose full job was asset tracking and preparing laptops for new hires.\nThen the Support team would work with new hires during orientation while Engineering IT level worked on systems access.",
    "label": "3"
  },
  {
    "text": "Hi everyone,  Cornel here :slightly_smiling_face:! I'm from Romania, in Dublin from last december, linux engineer, devops oriented, automation, looking to get a job here. Not there yet. Hope you are all good. :slightly_smiling_face:",
    "label": "2"
  },
  {
    "text": "<#C04GF3QK3|hiring-discussion> and <#C17P7HKTL|career-development> would be better places. <@U04CSTKMV> correct me if I’m wrong.",
    "label": "3"
  },
  {
    "text": "Hey folks, we're looking for a fantastic business development rep to join our team over at Koan! If you love the challenge of finding and developing new business, communicating with prospects online and on the phone, working on a team, and working harder and smarter than you ever have before - we'd love to talk.\n\n<https://angel.co/company/koan/jobs/725020-business-development-representative>",
    "label": "1"
  },
  {
    "text": "Hello everyone. My company is an approved IBM staffing vendor. We have an IMMEDIATE opening for a Java Full-stack Developer. Here's the thing, though, candidates need to be available for the interview via WhatsApp Video Call or Facetime ONLY. Please apply here: <https://jobs.mymobilelyfe.com/job/java-fullstack/>",
    "label": "1"
  },
  {
    "text": "Hi,\n \n\tMy name is Steve Porter and this is a response to your Denver Devs job posting for a Serverless Engineer. As can be seen on the enclosed resume I have recently acquired full stack web development skills at Devetry Code Forward in Denver, CO.\n\tMy most recent project, developed at Devetry, has a Vue.js front end, a Python Flask backend with a Pandas import for DataFrame object management, and a PostgreSQL database. If you find the time please have a look at that project here: <https://github.com/sporter399/deltakaggle>\n\tI learned the fundamentals of object oriented programming in Python and Java when I acquired an Associate Degree in CS in California in 2017. This gave me the foundation for learning full stack development this year.\n Best,\nSteve Porter",
    "label": "3"
  },
  {
    "text": "Hi everyone,\nI'm looking for a JavaScript Developer with extensive experience with Mapbox to join my client on a remote basis.\nMy client are in the health industry and are looking for a developer to help them on their mobile applications.\nThis will be a contract role, and my client can pay up to $300/day.\nPlease DM me for more details if you're interested",
    "label": "1"
  },
  {
    "text": "Hi all! Hermeus is a startup working to connect the world faster through high-speed (hypersonic) flight. We are currently looking for a DevOps Engineer and IT Lead to join our team. Full-time, competitive salary, stock options, unlimited PTO. We're located at PDK in Chamblee. Aerospace/aviation experience is a highly desired. Must be a US Citizen or GC holder to be considered. Check us out here: <http://www.hermeus.com/careers>",
    "label": "1"
  },
  {
    "text": "Hello All,\n\nWe are looking for android engineers to join our team at League Inc. <https://league.com/ca/>\n\n*Location:* Toronto, Ontario\n*Hours:* Flexible! You can work from the comfort of your own home for a few days during the week!\n*Perks:* Unlimited Vacation, Snacks and Lunches, Massages, etc.\n*Tech:* We use Kotlin for all of our newest features!\n\nWe are looking for senior and intermediate android engineers. Feel free to reach out to me for more information!",
    "label": "1"
  },
  {
    "text": "_*Dynamic, growing machine learning software company seeks curious, talented, and passionate AI/ML algorithm developers and data analysts.*_\n\n*Who’s CoVar?*\n\nWe are a small band of researchers, engineers, and software developers who love what we do and are looking for others to join us. We are at the cutting edge of machine learning and computer vision and constantly striving to understand more and do more. We conduct research and develop software products for many different customers. Some of our customers look to us to find bad guys and bad things in military sensor data—helping to keep our nation and our servicemembers safe. Other customers need help finding new cures for diseases hidden across existing biomedical databases—saving the lives of those stricken with rare diseases. Other customers use our products to monitor machinery and workers in the energy sector, preventing injuries and environmental catastrophes. We stop bad stuff from happening.\n\n*What is it like to work with us?*\n\nEvery one of us is absolutely passionate about what we do, and this passion is infectious. We love to debate new ideas on their merits—our white boards are constantly in use. We love to see if our ideas will work and are constantly experimenting, prototyping, and tweaking. We enjoy working on a variety of projects—which makes it fun to have many customers with varied problems. Some of our work is heady research, some is fast-paced product development. The most interesting projects are both.\n\n*Who are we looking for?*\n\nWe’d like to grow our team with research engineers/algorithm developers who are:\n·       Passionate and proficient in some subset of machine learning, computer vision, natural language processing, image processing, signal processing, Bayesian inference \n·       Take a hands-on and statistically-sound approach to solving problems\n·       Curious about the underlying domain physics of a problem space \n·       Excellent at communicating these concepts to our customers\n\nWe are hiring for our Durham, NC location and are looking for folks who are eligible for security clearances.\n\n*What Do We Offer?*\n·       Competitive salary, cash bonus, and equity structure \n·       401k with employer contributions \n·       Excellent health care coverage, including dental and vision plans \n·       Flexible work schedule \n·       Rewarding, varied, and intellectually stimulating work \n·       Non-hierarchical and inclusive environment \n·       Opportunity to learn and grow as an engineer—wherever you are in your career\n·       Re-location expenses\n\nEmail us: <mailto:careers@covar.com|careers@covar.com>\nVisit us: <http://www.covar.com|www.covar.com>",
    "label": "2"
  },
  {
    "text": "How do you/engineering get your internal team to report bugs? I’m looking for a better method other than “DM me on Slack”",
    "label": "3"
  },
  {
    "text": "Hey Denver Devs! I just relocated to the area 2 weeks ago.  I am a Scrum Master but also have a background in UX/UI.  Looking forward to connecting with some talented, creative people. Feel free to reach out anytime! :smiley:",
    "label": "3"
  },
  {
    "text": "The biggest strength that habitat has is its ability to let your team develop applications. If you ever take a look at the cloud landscape, there are so many places where you can deploy your apps: in a container, on bare metal, in a vm, on a K8s cluster, etc.  For a team starting new and don’t know where you will deploy just yet or don’t want to spend time on that right now, you can defer those decisions for some time and just focus on building applications. ",
    "label": "3"
  },
  {
    "text": "[ Senior Backend Developer (6+ years) ][ Fulltime Position ][ Onsite - Munich, Germany ]\n\nHi everyone, we’re currently looking for Senior Backend Developers with experience in Ruby on Rails to join our international team. Full job description is in the attachment. Interested? Please DM me your CV!",
    "label": "1"
  },
  {
    "text": "*Rigor is hiring for a Senior UI Engineer!*\n\nYou'll be hands on by:\n• Developing the front end of our application and leading front-end architectural decisions\n• Providing feedback to our designers\n• Mentoring others work on the team\nEvery member of our team cares deeply about building high quality software that solves real-world problems our customers care about. Rigor offers a *fun and flexible work environment* , *great perks* , and ample *opportunity and ownership* within our fast growing organization.\n\nInterested in learning more about the role? Apply here! <http://bit.ly/2up7eH2>\n\nLearn more about our team and culture @teamrigor on Twitter and Instagram :slightly_smiling_face:",
    "label": "1"
  },
  {
    "text": "Hi Victoria, I see that there are no Junior positions posted. However you do have Javascript developer positions. Is STSI flexible in the amount of experience someone has?",
    "label": "3"
  },
  {
    "text": "Hi there how are you? :wave::wave:\nI hope everyone in here is doing fine!!! I am a recruiter :female-technologist: and at this moment have an open position :star:REMOTE - US BASED:star: for a Senior Engineer Python, Ruby, Javascript! :female-singer::male-singer:\nHere the JD <https://jobs.lever.co/verypossible/13f83b10-063c-46fe-8192-eeada4bd23f3>\n:vibration_mode:Please let me know if someone might be interested or you happen to know someone for the role!:vibration_mode:",
    "label": "1"
  },
  {
    "text": "Hi everyone! I'm Alex Horsey, Internal Communications Specialist at Ruby (<http://ruby.com|ruby.com>). Looking forward to learning from other people geeks and hopefully sharing some of our culture/comm tips as well!",
    "label": "2"
  },
  {
    "text": "I know this is like 4 days late but my company is hiring for systems/devops people. We use Docker extensively. It's fully remote and location-independent.\n<https://10up.com/careers/systems-engineer/>",
    "label": "1"
  },
  {
    "text": "Hey Everyone,\nWe're looking for UX/UI Product Designers in both the NYC and Boston locations. In NYC, we're looking for someone who has experience designing within the mobile/entertainment industry (prior experience at NBC, CBS, Hulu, etc. preferred). In Boston, we're simply looking for the most talented design individuals in the market. DM me, or email me your portfolio/resume @ <mailto:christian.palmer@topfolio.co|christian.palmer@topfolio.co>\n\nHope everyone had a great weekend and is ready to conquer the day!",
    "label": "1"
  },
  {
    "text": "1 phút PR :okay:: We are looking for senior JS engineer with great benefits, more details here <https://weworkremotely.com/remote-jobs/ensight-designer-js-developer-experienced>",
    "label": "1"
  },
  {
    "text": "<http://aware3.com|aware3.com> | Full-time\nWe help non-profits (churches, schools, etc) connect with their communities via technology. Currently still a small team, but we must be doing something right, because we’re growing. Seeking Android Developers - Remote | KC - Apply: <https://a3a.me/3443a> . I’m the hiring manager.\n\nRead about our great Engineering team’s values here:\n<https://medium.com/@aware3/tapas-teamwork-850b0b06f43d>",
    "label": "2"
  },
  {
    "text": "We are looking for Sr. Android Engineers to join our Media Group in New York City.",
    "label": "1"
  },
  {
    "text": "hey y'all -- ive got a friend who's company is hiring react and node devs -- you can find the jobs here: <https://jobs.help.com>",
    "label": "3"
  },
  {
    "text": "Global Health Corps is hiring an Impact and Learning Manager to help develop the internal monitoring and evaluation systems that deliver useful data and feedback to teams across GHC. GHC's mission is to mobilize a diverse community of leaders to build the movement for global health equity.\n\nLocation: New York, NY\n\nLearn more &amp; apply: <https://www.techjobsforgood.com/jobs/1953>",
    "label": "1"
  },
  {
    "text": "Hey ya’ll My name is Mathew (yep just one ‘t’)  I just moved back into town after living in Lexington since school and I’m in the market for new job. I’ve had 5+ years as a full time dev and in the last year+ I had a great opportunity to step away from full time coding to work more on Technical Product/Project management. I couldn’t find the Cincy Product Management slack (does that exist???) but I’ve seen a couple Product/Project management jobs posted here so I thought I’d give it a shot! I’m looking to keep working in Technical Product/Project management helping to make sure a dev team is running smoothly but can still lay down some code if needed :slightly_smiling_face:\n\nI attached my resume...If anyone knows of anything or if you just want to say hello don’t hesitate to message me :slightly_smiling_face: thanks!!",
    "label": "3"
  },
  {
    "text": "Hi All,\nI'm looking to speak with any Senior or Lead Front End Devs looking for a change of scenery on the job front:mountain:!\n\nThe role will have you working with :clipboard:: JavaScript, AngularJS, HTML, CSS, Bootstrap, C#, Azure and be based at Kings Cross, London. The role will immerse  you into the world of digital finical services and I  have up to £10Ok available to play with :moneybag:!\n\nIf you have any further questions please DM me!\nIf you want to share your portfolio please :e-mail: me - <mailto:adam.clayton@experis.co.uk|adam.clayton@experis.co.uk>",
    "label": "2"
  },
  {
    "text": "Hello friends, we at Solytic are currently looking for a *senior frontend developer* who is available to join us as a *freelancer* for the next 6 months.\nOur company is a data-driven startup developing a platform for solar plant owners/managers that helps them optimise their profitability. Within only 2 years we grew to over 100,000 solar plants, making us the fastest growing solar software company since funding worldwide.\nIn the course of a recent merger with one of our competitors, the companies' two separate monitoring portals are being combined into one new main core product. Therefore, our tech team needs support in developing the website, respectively the user interface with chart elements.\nFor more detailed information please refer to the attached document.\nMaybe someone here is looking for a new project to work on. If so, feel free to contact me.\nTheresa :)",
    "label": "1"
  },
  {
    "text": "*[Permanent][Onsite in Dublin/Ireland - NO REMOTE][ Won't Sponsor so must be EU citizen]*\n\n*Hey all, happy Monday! I am working with 2 clients based in Dublin City Centre who are looking to hire a few Rails engineers here in Dublin - they are both product focused roles so you will be actually working on things that will go to product instead of just big fixing etc. One company is in the eLearning space and the other is a new team that is being built in the HR Software Space - both interesting and well paid.*\n\n*Hit me up if you want more details and as I mentioned above, they won't do remote so please don't ask and I don't want outsource help either. Ta!*",
    "label": "3"
  },
  {
    "text": "It's rendered here <https://dakra.github.io/mui-templates/> and locally in dev mode it looks nice. (repo is <https://github.com/dakra/mui-templates>)",
    "label": "3"
  },
  {
    "text": "Hmm. I don't see any difference with either `--pseudo-names` or `--debug`. I don't get 404 anywhere. it works almost as expected just `recharts` is not displayed and some css looks slightly wrong which is correct when I do the dev build.",
    "label": "3"
  },
  {
    "text": "Hello i'm Mimoun Majd a software engineer i just joined @HelloZack in Paris coming from Tunisia  and i tried some stuff with strapi and it looks awesome :slightly_smiling_face: Have a nice day :slightly_smiling_face:",
    "label": "3"
  },
  {
    "text": "but now I see that it works nice locally with e.g. `shadow-cljs watch app` but\nwhen I make a release `shadow-cljs release app` it doesn't show my chart\nand some things doesn't seem to work without any error output.\nI'm new to clojurescript, any tips to debug this or some common gotchas\nI've to look out for that makes the release different from the dev version?",
    "label": "3"
  },
  {
    "text": "Hey everyone,\n\nProminent Edge is hiring! We are looking for a .NET Core Developer. This position is on-site in Cincy, though we're generally a fully remote company and you'd eventually work on remote projects too.\n\nYou will be working with C#, Dapper ORM, and SQL Server.\n\nYou'll also help with our other projects over time, most commonly using:\n\n- React / React Native / Angular / Vue\n- Node / Python / Java\n- Postgres / Elasticsearch\n- Serverless / AWS\n\nOur benefits are pretty nice:\n\n- $0 premium (free) insurance with $750 individual deductible\n- 6% 401k match\n- 6 weeks PTO+Holiday\n- Paid for any overtime\n- Annual retreats (Yosemite, Puerto Rico, Puerto Vallarta)\n\nI'm a Senior Software Engineer at Prominent Edge.\nPlease let me know if you are interested or have questions!",
    "label": "1"
  },
  {
    "text": "Reminder: :tada: Welcome to PhillyDev! This is our weekly welcome/reminder. In PhillyDev we discuss programming, <#C0JM0R4V7|career>, share <#C03F9S5LL|job-postings>, <#C04C47FUF|events> … and most everything else. Look for any language you're interested in (ex. <#C03EC8BSW|javascript>, <#C03G1CZLM|python>) or meetups you're a member of (<#C03FZPG5C|phillydevops>, <#C03G467PY|software-as-craft>), and it's probably here! You’ve been auto-added to <#C03G04GL7|lunch> (for meeting people IRL) and <#C03EC6Y8L|chat>! \n\n*This channel (<#C03EC6Y8C|general>) is for this and other PhillyDev general announcements*. Check the sidebar for the full channel list (there’s a lot!). Have a question or concern for the admins? Or a question in Slack about this Slack? Ask it in <#C0H456MQQ|meta>.\n\nTo invite someone to this Slack, use the `/invite_people` command (from desktop, mobile doesn't work). Be sure to fill out the whole form, or your request will be rejected. And don't forget to familiarize yourself with our Code of Conduct! <https://phillydev.org/#conduct>",
    "label": "2"
  },
  {
    "text": "I still get called to look at problems on very old systems, ones that predate modern CI/CD pipelines. First thing you have to do is run a tree diff on the live installation against the dev instance, to see what has drifted over time. Some of these trees are enormous, and some of the rulesets for which changes matter and which don't are complex. Araxis slices through that part like a hot knife through butter.",
    "label": "3"
  },
  {
    "text": "*GROUNDFLOOR* is hiring *senior software engineers* and we’re looking for people want to:\n\n:mount_fuji: Do work that has merit and meaning\n:house: Work in a small, but growing company, where _ownership_ matters\n:boom: Make an impact on the customers, the team and the company\n:ship: Frequently ship scalable software\n:mortar_board: Mentor, grow and guide others\n\n:tada: *Benefits* :tada:\n:trophy: Strong focus on your growth in the role (frequent open feedback &amp; leadership opportunities)\n:moneybag: Salary: $130k - $150k / matching 401k / options\n:eyeglasses: Great health/dental/vision\n:bank: Based out of Midtown (Bank of America)\n:vue: _&amp;_ :ruby: but we’re quickly expanding in to other areas as we grow\n\nThanks and reach out to me to apply or for more details",
    "label": "1"
  },
  {
    "text": "Hi Everybody.  I'm an iOS Dev in the UK since 2010.  Just learning SwiftUI today and looking forward to sharing and doing the continual learning thing.",
    "label": "2"
  },
  {
    "text": "_Repost:_ I am partnering with a client looking for someone to be an Front-End SME and help a local client modernize one of their products. They are looking for someone with the ability to come in and take a consultative approach, help with architecture, and development with the latest Angular (Version 8 ) with all greenfield development. Senior UI Engineer\n* $65-75/hr (flexible on rate)\n* Brookfield, WI\n* Greenfield Development/ SaaS /Component Libraries\n* Know someone that can do this? I can offer a referral bonus :money_bath:",
    "label": "1"
  },
  {
    "text": "Hey Web Zurich, we're looking for a web developer / designer to join our product team at Rivero ( <https://rivero.tech> ).\nWe are a tech-oriented startup who's building a couple products and we're committed to building it right. We know that there are many interesting challenges ahead, but we are super motivated and excited to deal with them. We're not afraid to tackle the difficult things because that's the best way we can learn and grow. We are radically transparent in communication with each other and at the same time open-minded to questions, informed comments and grounded disagreements.\nThis is an early-stage role, which means you will need to bring the correct mindset and willingness to discuss, design and dissect the front-end tech stack. We have two projects where we're using Vue.js + REST and Web Components + LitElement + GraphQL.\nYou can see more details about the job position on our website. If that sparks your interest, get in touch. Cheers!",
    "label": "1"
  },
  {
    "text": "Our companies problem is we develop tax software so they hire accounting grads right out of college and teach them how to code the software in the first 3 months. So we both need someone who can work with extremely complicated tax code with makes no sense logically and also be able to code. The two really don't go together well.",
    "label": "3"
  },
  {
    "text": "Big Nerd Ranch is hiring for several backend developer roles working with Golang, Java, and Node (Atlanta or remote). If you want to get out of the enterprise culture and work at a company that values relationships and your personal development as an engineer, BNR is a great place to work. Lots of opportunities to cross over into mobile and frontend JS development. Feel free to DM me with any questions I can answer! <https://bignerdranch.applytojob.com/apply/Leuf6nmhtV/Backend-Developer>",
    "label": "1"
  },
  {
    "text": "Hey All!\n\nAre you a Data scientist or Data engineer?\n\nThen i got multiple roles on right now\n\nLead Data scientists for a AI Startup here in copenhagen working with NLP\nAnd\nI am looking for multiple senior Data scientists and Engineers for vodafone UK - London\nAnd\nMultiple Data scientists and Engineers for volvo cars in Gothenburg or Stockholm\n\nI am just getting the details in, so reach out to me and we can speak in more details about the stacks and specifications.",
    "label": "1"
  },
  {
    "text": "Hello, I am Ajani from Tunisia I have a Master Degree in computer science and I'm turning now to web development I started with HTML, CSS and then Javascript, I'm looking for people who share the same passion as me so we can learn and create beautiful things together.",
    "label": "3"
  },
  {
    "text": "If you're looking to learn and experiment with the system, creating virtual block devs is an easy way to go.",
    "label": "3"
  },
  {
    "text": "looks like you’re trying to attach an extra volume at the same mount location as the root block device is already mounted",
    "label": "3"
  },
  {
    "text": "Gig Connected (<http://www.gigconnected.com|www.gigconnected.com>) is looking for a Ruby on Rails developer to join our team in a part time capacity.  We have a number of functions and features that we are developing for 2020 as we gear up for pilots with national companies. We're open to junior developers. The position will report into our Head of Software Development, a developer with over 15 years of experience across industries and company sizes.\n\nA little about Gig Connected: we're a mobile friendly web application that improves the construction staffing process. We provided better insights into worker skill sets as well as employers to make better job matches. We work with many non-profits that provide skills and certification training. Our goal is to improve economic mobility through the trades and have been awarded grant funding from several foundations.\n\nPlease let us know if you or someone you know might be interested in learning more about this position or Gig Connected.",
    "label": "1"
  },
  {
    "text": "Hi everyone! I'm Josh a London Based startup founder and product designer. Have been working on impact projects for years now and so glad to be part of a growing community. I've just started running monthly ideation workshops to bring people together to come up with new projects to tackle various Climate Crisis focused challenges. Find more about us <http://cvcollective.mailchimpsites.com/> , and sign up to the first event: <https://www.eventbrite.co.uk/e/the-climate-venture-collective-collaborating-to-solve-the-climate-crisis-tickets-95293688989?aff=ebdssbdestsearch>  Thanks :grin:",
    "label": "2"
  },
  {
    "text": "This sort of thing was how I went from CSM to dev. I think a lot more people should spend some time in DSE actually, you learn something from the \"oh my god I'm looking at another weird idiosyncratic code base every few hours\" factor",
    "label": "3"
  },
  {
    "text": "Not my role, someone just sent it to me. Thought it might be of interest for ppl looking to transition from customer support to more of a developer role\n<https://stripe.com/jobs/listing/developer-support-engineer-dublin/1953141>",
    "label": "3"
  },
  {
    "text": "Hi, can telepresence be used to forward service calls to a remote cluster from a cluster running in minikube? Basically what we are looking for is a solution for local development in minikube where some of the application services are running remotely (in a remote k8s cluster) and some are running in minikube.",
    "label": "3"
  },
  {
    "text": "Hi <@U78NB4MB8>. We do have some openings reunited all in the form of \"data engineer\" here on our career page: <https://upstack.co/careers> . I'll PM you to share some details :slightly_smiling_face:",
    "label": "1"
  },
  {
    "text": "I second what <@U8SFYQ3NZ> describes. My previous gig we had PMs focused on few areas (not components, but say business-related themes) and component/feature teams managed by POs. We ended up having limited resources (cross-team tech dependencies are :skull:), so had very limited resources. eventually ended up being VP PM, then two PMs (me and a colleague, who focused on onboarding/developer's journey) combined with POs, who we made the owners of roadmap (not strategy though!), and that required them to interface more frequently with customers and be the ones responsible for prioritization (not PM, who focused on setting the context/strategy with business peers). am trying to set up something similar at my new gig (very lean, small teams).",
    "label": "3"
  },
  {
    "text": "Another way to look at is what types of products are you supporting and how big are those products. I've seen the PM/PO combined role in most organizations, but that's been doable because they've had relatively small scrum teams supporting them. Once you hit a certain capacity with engineering, there are only so many requirements one person can create every sprint. And once you layer in the need for strategy/research/planning on the PM side, you can see that it comes down to how much can one person do.",
    "label": "3"
  },
  {
    "text": "Hi guys, we are looking for Xamarin and .Net Core backend developers. We are based in Austria :flag-at: and develop the app tonestro (<https://play.google.com/store/apps/dev?id=4950251523533454689&gl=AT>).\n*Tech stack:* C#, .Net Core, Xamarin, Azure, Razor, Rider\nFor more infos see attachment or send me a pm.",
    "label": "1"
  },
  {
    "text": "Hi all,\n\nI am looking for freelance project as developer or project leader. I have 10 years development experience and well versed in ReactJS, NestJS, NextJS. I can also help with your devops setup in AWS, Azure or other platform.\nFeel free to get in touch by DM.",
    "label": "2"
  },
  {
    "text": "I'm looking for a freelance frontend dev to turn UX/UI prototypes (Sketch/Invision) to life. I'm after responsive, mobile-first, maintainable HTML/CSS/SASS/JS. React skills would be a huge plus. Hoping to work with someone local. DM me if interested or if you can recommend someone. Thanks!",
    "label": "1"
  },
  {
    "text": "Hey all - I'm looking for a freelance frontend dev to turn UX/UI prototypes (Sketch/Invision) to life. I'm after responsive, mobile-first, maintainable HTML/CSS/SASS/JS. React skills would be a huge plus. Hoping to work with someone local. DM me if interested or if you can recommend someone. Thanks!",
    "label": "1"
  },
  {
    "text": "This link looks fairly thorough, it's a free(mium) pdf on how to establish a developer career. I found the stats on highest demand languages vs highest paid interesting, and they have a bunch more findings. Catch is, you have to sign up for a Tech Republic account: <https://www.techrepublic.com/resource-library/whitepapers/how-to-build-a-successful-developer-career/post/?ftag=CMG-01-10aaa1b&amp;regId=&amp;asset=33163076>",
    "label": "2"
  },
  {
    "text": "```/dev/nvme1n1    2.9T  2.2T  776G  74% /usr/share/elasticsearch/data```",
    "label": "3"
  },
  {
    "text": "Hey everyone,\n\nProminent Edge is hiring! We are looking for a .NET Core Developer. This position is on-site in Cincy, though we're generally a fully remote company and you'd eventually work on remote projects too.\n\nYou will be working with C#, Dapper ORM, and SQL Server.\n\nYou'll also help with our other projects over time, most commonly using:\n\n- React / React Native / Angular / Vue\n- Node / Python / Java\n- Postgres / Elasticsearch\n- Serverless / AWS\n\nOur benefits are pretty nice:\n\n- $0 premium (free) insurance with $750 individual deductible\n- 6% 401k match\n- 6 weeks PTO+Holiday\n- Paid for any overtime\n- Annual retreats (Yosemite, Puerto Rico, Puerto Vallarta)\n\nI'm a Senior Software Engineer at Prominent Edge.\nPlease let me know if you are interested or have questions!",
    "label": "1"
  },
  {
    "text": "Can I suggest that advertising for a “gun” DevOps Engineer is going to limit your hiring pool in ways you don’t intend?",
    "label": "3"
  },
  {
    "text": "Hi everyone, I am a rising senior majoring in Software Engineering, and am searching for PM internships. Let's connect on Linkedin! <https://www.linkedin.com/in/joyce-lee-1810|https://www.linkedin.com/in/joyce-lee-1810>",
    "label": "2"
  },
  {
    "text": "Good evening I hope you all are having a great day. I am looking to apply for an IT Asset Management Specialist position at my job and I would like to know if you all can share any tips, interviews questions and any research links that would help me understand the position and responsibilities needed. I am looking to transition over from the Accounting department and I have been taking on workshops for the past year to get a feel of what I maybe interested in. I believe this would be a great fit but I want to be able to articulate and understand before I move forward. So if you can please share your knowledge. Thank you so much in advance:hugging_face:",
    "label": "3"
  },
  {
    "text": "Hello fellow CFers!  We’re looking to hire a Cloud Foundry operations engineer.  100% remote, but US-only.  Full time, but happy to work with contractors.  Heavy on Concourse, Terraform, BOSH, Credhub, Docker and CF.  Some Kubernetes.  Oh, and bash.  Lots of bash.  The role isn’t online yet, but it’s very similar to <https://superorbit.al/careers/devsecopsre>.  Email <mailto:work@superorbit.al|work@superorbit.al> with any questions or interest.",
    "label": "3"
  },
  {
    "text": "Hello everyone,\n\nUnfortunately, my role has been cut at my current company. I am seeking employment in the San Francisco / San Jose area if you know of any employers that would be interested in a visual designer please let me know! I would greatly appreciate it",
    "label": "3"
  },
  {
    "text": "OK - so I'm starting a new gig where for the first time I'm developing on a Macbook. I've done most of my previous stuff in the Linuxs (Linices?), WSL and Windows as my dev machine. What are the must have tools to get on there?\n\nI've already put on homebrew",
    "label": "3"
  },
  {
    "text": "Hello Everyone!\nI'm a recent bootcamp (Turing) grad looking for a back end dev role in the Denver area. I've worked with Ruby and Rails mostly, but I'm happy to branch out and learn more.",
    "label": "1"
  },
  {
    "text": "Hi all, I run a small agency with developers split between the UK and SA. I'm looking for someone to join us as a contractor full time, or as close to full time as possible.\n\nThings we are currently using:\n• PHP 7 and some legacy 5.6 stuff that used Zend\n• Lots of WordPress projects based on Sage\n• Sometimes non-wp projects using Laravel\n• Git, Composer\n• Frontend using SASS generally with Laravel Mix, plenty of npm packages and sometimes a bit of Vue\n• Lots of AWS to run various server setups for ourselves and clients\nI don't expect anyone to be an expert in all of these areas but the more you can tick off or have basic knowledge of the better.\n\nThe whole team is remote so location is not an issue as long as we can work to GMT+/-3 so that there is some core hour crossover.",
    "label": "1"
  },
  {
    "text": "Hey all! :smile: My name is Nicole and my team @ Uber is growing! We’re currently hiring for Sr. HR Specialists in Seattle &amp; Phoenix, as well as a ER Engagement Partner in SF. :)\n\nIf you or someone in your network interested, please apply directly to the postings here  - <https://www.uber.com/us/en/careers/list/?department=People%20%26%20Places|https://www.uber.com/us/en/careers/list/?department=People%20%26%20Places>",
    "label": "1"
  },
  {
    "text": "Hi all\nI run this small Product Studio called Calypsu. We do UI/UX design and development. I’m looking for projects. In case of any requirement, please drop me an email on <mailto:aanand@calypsu.com|aanand@calypsu.com>",
    "label": "2"
  },
  {
    "text": "I don't know what's behind my walls &amp; not sure I have easy access. But I don't have central air so maybe it's a good thing nothing is blowing around in there.\n\nBut be careful about all that! When I lived in Bridgeport, there was a toilet pipe leak above me..bathroom ceiling was a terrible idea to have office tiles looking ceilings.. They replaced the tile but left pounds of dead roach, mold, dust all over bathroom completely coated, that I had to clean. It smelled  worse than rotting bread.\n  I'm sure the cause to why I fell ill immediately that night after inhaling it, my stomach hurled.. days having to run to bathroom,and  tummy has never been the same after that! I suddenly for years wasn't able to eat any tomatoes and tons of stuff I use to eat ..\n\nBut I'm finally able to most normal stuff again the past few years .. fixed it with probiotics and bunch of foods..\n\nDoesn't look like you have roaches and that might not be mold unless there's moisture trapped like pipe leaks.. but any dust sensitivities that could develop I which I knew about needing facemasks at that time!",
    "label": "3"
  },
  {
    "text": "Hey there! This is Ed, I am a backend developer working almost exclusively in Python, been doing so for many years now. I've decided to join this in order to track a few projects I'm interested in (especially `pipenv`), looking forward to meeting y'all :wave: .",
    "label": "2"
  },
  {
    "text": "I just saw Waffle House is hiring a senior web dev. Really low applicant rate",
    "label": "3"
  },
  {
    "text": "Looking for a Full Stack #laravel Developer who is willing to relocate to #kuwait having at least 3 years of experience. #hiring #jobs #php #laravel #gulf #recruitment #Fullstack",
    "label": "1"
  },
  {
    "text": "Good morning. I hope you all are having a great start to your morning. I am looking to apply for an IT Asset Management Specialist position at my job and I would like to know if you all can share any tips, interviews questions and any research links that would help me understand the position and responsibilities needed. I am looking to transition over from the Accounting department and I have been taking on workshops for the past year to get a feel of what I maybe interested in. I believe this would be a great fit but I want to be able to articulate and understand before I move forward. So if you can please share your knowledge. Thank you so much in advance:hugging_face:",
    "label": "3"
  },
  {
    "text": "Folks have a look at this code <https://github.com/hyperledger/fabric-ca|https://github.com/hyperledger/fabric-ca> does it look like it has been written by Java Dev? Personally it looks excessively complex. What do you guys think?",
    "label": "3"
  },
  {
    "text": "Hi everyone,\nI am  experienced RoR engineer and I am looking for a remote job. Any timezone. Feel free to PM me with any questions or concerns. Thanks",
    "label": "2"
  },
  {
    "text": "Will someone test out my personal website on an iOS device and tell me how it looks? The navbar is collapsed on my father's iOS Safari browser. The website is incomplete right now, so appologies for the lack of content.\n\n<http://hbtest1694.000webhostapp.com/|http://hbtest1694.000webhostapp.com/>",
    "label": "3"
  },
  {
    "text": "You can check out the <#C4PDNEP0E|jobs-posts> <#C7X9GBZAM|jobs-seekers> and <#C7XNHTMEF|jobs-discussion> channels here on Charlotte Devs.",
    "label": "3"
  },
  {
    "text": "Hi everyone! I am a Product owner based in Germany working in mobile app development. Looking forward to learning new things and discussing product management topics with you!",
    "label": "3"
  },
  {
    "text": "Hi, I'm looking for developer to install the Nova app similar to \"<http://crater.io|crater.io>\" on my digital ocean serverand get the site up and running.",
    "label": "1"
  },
  {
    "text": "[remote] Looking for immediate start. 30-40hr contract positions - Sr. Full Stack engineer. $100/hr. React. Typescript. Postgres. 8-12 week gig. <http://flatfile.io|flatfile.io> - email me @ <mailto:David@flatfile.io|David@flatfile.io> (if you’ve DM’d about prev positions please HMU again, DMs get erased so fast on DD that I’ve missed replying before)",
    "label": "1"
  },
  {
    "text": "Anyone looking for a ReactJS or Java developer? Let me know I can send some references for Corp to Corp developers. ",
    "label": "3"
  },
  {
    "text": "Grin is hiring a DeVops Engineer and several full-stack software engineers (php/node/js) in the next few months!\n\nGrin's offices are in downtown Sacramento in the Wells Fargo building.\n\nIt is a fun place to work. We have some of the best customers in the ecommerce world (you have probably purchased from them) and we growing fast!\n\n<https://careers-grin.icims.com/jobs/1042/full-stack-engineer---full-stack-developer---software-engineer/job>\n\n<https://careers-grin.icims.com/jobs/1050/devops-engineer/job>\n\nYou can DM for more info as well.",
    "label": "1"
  },
  {
    "text": "Looking into this: <https://acowebs.com/woo-custom-product-addons/> -- but unfamiliar with the developer.",
    "label": "3"
  },
  {
    "text": "Hey Everyone! :wave:\n\nMy name is Rachel and I am currently located in Baltimore looking to move to Austin. My fiance and I plan to move in the summer but I wanted to start looking for opportunities as soon as possible.\n\nI am a Web Developer looking for Front End roles. I am competent with JavaScript and React but willing to work with other languages &amp; frameworks!\n\nIt's very nice to meet you all :grin:",
    "label": "2"
  },
  {
    "text": "Hi, so I am new here an not sure this is the best place to post this (so feel free to direct me to a new channel if so). I am currently a dev 1 with about a years experience as a full stack dev at a company in the area (have a CS degree as well). I was looking for some new opportunities in the area though. Is there good places to look or good companies to check out for jobs in the area?",
    "label": "3"
  },
  {
    "text": "[Looking for a part-time] [Software Engineer][Study Permit]\n:blush:Three years of experience in application development, business analysis, and data analytics, and process management. Has worked on projects for various large global corporations and promising start-ups. :blush:\n<http://tiny.cc/7ahdkz>\n<http://tiny.cc/tchdkz>\n<http://tiny.cc/ifhdkz>\n:rocket: Looking for a part-time but if you can help me with a work permit (which takes 10 days to get ), I’m definitely open for full-time:blush:\n*Location*\n:flag-ca: Vancouver, Canada\n*Skills*\n:rocket: Python, dotnet, Javascript, Vue, SQL, jQuery",
    "label": "2"
  },
  {
    "text": "Hey guys,\nWe are searching for an experienced Product Designer in Cologne. Do you have 4+ years experience or do you know somebody ??\n\nCool company, cool collegaes… so have a look at the position and apply!\n\n<https://boards.greenhouse.io/fitogram/jobs/4658507002>",
    "label": "1"
  },
  {
    "text": "Hey guys, i'm Chima, a Senior Software Engineer, and I'm happy to be in this server, as I'm looking forward to getting better at DevOps Engineering.",
    "label": "3"
  },
  {
    "text": "Hi everyone,\n\nMy day job keeps me pretty busy but I’d still love to make progress on 1-2 passion projects.\nTo that extent, I’d love to hire someone (on a small scale initially, could potentially grow fast).\n\nI’ve never really hired a developer, but I like this approach: <https://sivers.org/how2hire>\nSo my thought is, for a hiring process:\n• Please express interest by filling out this short Google Form\n• We have a 30-minute chat about programming, maybe pair for a little bit\n• Then I’ll pay you to complete a programming task as the last step, as the post suggests\nThe projects I’m working on, if anyone cares:\n• A productivity course",
    "label": "3"
  },
  {
    "text": "I have a service which requires around 300 key-value pairs. I created a config map for the same. If i deploy it using `kubectl`, it works fine. However, if i try deploying it using `helm`, the service fails to initialize.\n\n`spec:`\n  `containers:`\n\t`- name: {{ .Chart.Name }}`           \n\t  `image: \"{{ .Values.image.repository }}:{{ .Values.image.tag }}\"`\n\t  `...`\n\t  `...`\n\t  `envFrom:`\n\t  `- configMapRef:`\n\t\t  `name: my-configmap`\n\t\t\t  \nHere's a sample of the configmap file:\n`apiVersion: v1`\n`kind: ConfigMap`\n`metadata:`\n  `name: my-configmap`\n  `namespace: dev-ns`\n`data:`\n  `BASE_PATH: \"\"`\n  `CLARIFY_HOST: <http://dev.my.clarify.com|dev.my.clarify.com>`\n  `SERVER_ENV: dev`\n  `SERVER_PORT: \"8080\"`\n  `ENTITLEMENT: A_CIPHER`\n  `ENTITLEMENT_PATH: /v1/process/entitlement`\n  `EXPERIMENT_API: api/accounts-svc.raml`\n  `EXPERIMENT_API_PATH: /account-console/*`\n  `EXPERIMENT_HOST: 0.0.0.0`\t\t\t  \n\t\t\t  \nI can see the ConfigMap content using `kubectl.exe -n dev-ns get cm/my-configmap -o yaml` and at a glance, it looks fine. I did exec to container (immediately after it restarts) and could verify few env variable's content. I am not sure why it's still failing. Can it be that `helm` is not able to find the variables due to quoting issue? Any suggestions?",
    "label": "3"
  },
  {
    "text": "Hi <@URVC60604>\nWe are looking for a partner to join our AI marketing planning module development with VueJS skills. If you’re interested to be involved on the equity share, send me a PM ;)",
    "label": "2"
  },
  {
    "text": "Hi, i am Meshack from Nigeria, a software Developer from Nigeria, just came out of boot camp with skills on both front-end and back-end  technologies and trying to get my hands dirty with building stuffs, working on a logistics app presently and hope to grow and harness my programming skills doing so, looking forward to getting assistance from some of you here who are tech gurus already. thanks",
    "label": "3"
  },
  {
    "text": "Synamedia is hiring Software Engineers with GoLang experience!  A strong C/C++ developer with interest in rapidly learning GoLang also ok.\n\nMultiple jobs at various levels to develop large scale Cloud Video Streaming products in our Atlanta Metro location.  DM me for more details!\n\n<https://www.linkedin.com/jobs/view/1623198127/>\n\n<https://lnkd.in/eWE5iBq>",
    "label": "1"
  },
  {
    "text": "Any golf fans here :golf: ? If you didn't know the PGA of America is moving to Frisco in 2022 with a fantastic campus (and golf courses of course - <https://product.costar.com/home/news/shared/252842788|https://product.costar.com/home/news/shared/252842788>), but in the meantime we're building out new teams in Frisco, specifically around Technology.\n\nIf you're interested in React, Serverless Infrastructure, passionate about testing, and overall want to build great products then check out an opening for a Full Stack Developer (don't be scared by the title we're willing to teach and mentor) <https://theapplicantmanager.com/jobs?pos=p5191|https://theapplicantmanager.com/jobs?pos=p5191>\n\nWhat the team looks like now. Me: :wave: Product Manager (and some dev work too :wink:), UX Designer (world class), and a few contracted developers (we're trying to build an in-house team), plus great leadership who care. Definitely reach out if you have any questions, I'll be happy to answer them.\n\n\n",
    "label": "3"
  },
  {
    "text": "Hey everyone! I'm a full stack dev with 2 years of experience in a library context, and I'm looking for a new challenge. My experience is with a React, PHP, and MySQL stack in a Docker/AWS turducken with some Python scripting, and some familiarity with Rails.   <https://www.linkedin.com/in/stephen-h-a33184128/|LinkedIn>    <https://docs.google.com/document/d/1YNBdYXo6M4GwtocFGyoTeOzzzI1SdZfkwpFYWDTYJzM/edit?usp=sharing|Resume>",
    "label": "2"
  },
  {
    "text": "try strapi develop and change the init action value by searching with userpermission role name public",
    "label": "3"
  },
  {
    "text": "Hi everyone, I’m looking to change my DB to postgres. I created the project using the quickstart which gave me an SQLite database, but I’d like to use Postgres in production. Is there a guide for setting up strapi with Postgres for the local development environment anywhere?",
    "label": "3"
  },
  {
    "text": "Hi Everone, This is Shahid, we are working on a machine learning model, looking for someone who can help us to integrate with Flask / django app to reduce response time. Please reach out if you can help us. Also hiring fulltime / parttime python engineer for our chennai office.",
    "label": "1"
  },
  {
    "text": "Currently, I'm looking for 100% remote job.\nIf you need liked this, please let me know.\n\nI am a full-stack developer who is looking for a client who can work with me in a long term relationship,\n\nI am hungry with a job and wanted to ask you if you can help me out.\nI am looking for a client whom I can dedicate my full-time work as a long term relationship.\n\nI have got hands-on experience of turning startups into success before.\n\nSpecialties: PHP(CI, YII, Laravel) framework, MERN stack [MongoDB, Express, React, Node.js], MEAN stack [Angular], Shopify, Swift, React Native, Wordpress, Python/Django, Magento, Opencart, DebOps(AWS), GraphQL\n\nMy work time is from Monday to Friday (can work on client timezone, flexible)\n\nLooking forward to hearing from you soon.\nRegards,\nJack",
    "label": "2"
  },
  {
    "text": "Any senior/experienced .NET devs on here looking for a change? DM me",
    "label": "3"
  },
  {
    "text": "Hello team! Great to be part of this amazing channel. I do have two questions that we 'I'd appreciate if I could get the team's input in: \n1. How important or how far should I go in terms of tech to be a good and productive PM who commands respect and is looked up to and listened to by the engineering team? Should I attend a fullstack bootcamp for instance to be well versed? \n2. What's the hardest bit of your P.M role as of now?",
    "label": "3"
  },
  {
    "text": "Hey Everyone, I'm working on 4 differnt mid-senior level .net developers here in Knoxville and in Chattanooga. They are looking for candidates with experience with API intergration, C#,MVC, and SQL. DM me if interested:grin:",
    "label": "3"
  },
  {
    "text": "We are a fast growing loyalty tech company supporting some of your favorite loyalty apps, we have a few tech positions plus others. Tech positions: POS Deployment, MySQL DBA, Sr. Full Stack Rails Developer, and DevOps Engineer please DM me if you are interested: <https://punchh.com/careers/>",
    "label": "1"
  },
  {
    "text": "Hello Boro.Dev! I am a full time student soon to graduate in May with a CS degree from MTSU. My main focus has been C++, python and MySQL back end development, but have been assigned to develop a React web app for one of my final projects. I attended the introduction to React meetup yesterday, and am glad I did because the whole group was very open and inviting. Looking forward to collaborating with and learning from you all going forward.",
    "label": "3"
  },
  {
    "text": "I never really developed a taste for duck. I kinda wish I had, it always looks good.",
    "label": "3"
  },
  {
    "text": "Looking for a part time designer to help me build <http://ForBabyTellsMeSo.com|ForBabyTellsMeSo.com> - an app that helps feeding therapists track infant feeding data trends. DM me.",
    "label": "2"
  },
  {
    "text": "## What are some blockers with learning how to think in abstractions with code? Do people who take things literally have more problems with this than others?\n\nHonestly, it's just an experience thing. The opposite can be a problem (being unable to think literally), but comfort with abstractions comes from following certain steps long enough and giving a name to the pattern.\n\n## Talk more about topic ghettos\n\nTopic ghettos are when you group up a bunch of related things and teach them at the same time, but independently from how they're actually applied. In other words, teaching a gaggle of math concepts together is tidy, but if each of the math concepts are applied in wildly different ways it's difficult to create relevance with them.\n\n## How is coding is different than other kinds of skills?\n\nIt isn't. It has more in common with throwing a football, meditating, or dancing than it doesn't. A difference might be that it can be used to leverage so many other skills that it makes _them_ more valuable in the process, but it's acquired and developed in the same way.\n\n## Whats the best advice you'd give developers on searching for the right job? (Particularly when it's the 1st job out of school)?\n\nNetwork. Cold applications to job postings are fine and should be in your rotation too, but you have a much better chance going through someone you've met, in-person or virtually. In order of preference, companies generally hire for roles:\n\n1. Internally (\"We moved Sarah into that role\")\n2. Internal referral (\"Sarah recommended someone\")\n3. External referral (\"Sarah knows someone who recommended someone\")\n4. Closed external posting (eg. Denver Devs gigs post)\n5. Agency recruiter\n6. Open external posting (eg. Indeed)\n\nOne of the reasons you don't see a ton of \"Jr. Rails Engineers\" on public job boards is because it's so much easier to fill those jobs the other ways. Go meet some people.\n\n## Thoughts on the Lambda School scandal?\n\nThey are a garbage school run by Silicon Valley children, and they deserve the criticism they're getting. That said, a lot of the people criticizing them _also_ don't know shit about education and some of their critiques are completely invalid. For example, hiring your students isn't some cost savings measure or a way to pad the numbers. Even in Lambda's case, if every one of their 170 employees was a _currently enrolled_ student it would juice their garbo placement numbers _for only that class_ about 5%. People who recently learned something are a treasure in a classroom. Also \"teacher\" is one of the most common jobs in America. The chances of finding a dev who can teach their way out of a paper bag is pretty hard; the chances of finding a great teacher in a program for career changers is really high. I've hired tons of my students, and will continue to do so.\n\n## Can agile be used in teaching/learning?\n\nAbsolutely! My education teams work in day-long iterations, we plan each morning and retro each afternoon, we collect lots of data, and only do the highest priority things.",
    "label": "3"
  },
  {
    "text": "FOR HIRE:\n\nHi everyone, my name is Ryan and I am a UX/UI designer looking for jr level work. Checkout my portfolio here <https://ryanhalperin.myportfolio.com/>. \n\nThank you!",
    "label": "2"
  },
  {
    "text": "Yes, our group is looking for a python dev <https://careers.peopleclick.com/careerscp/client_argonnelab/external/jobDetails.do?functionName=getJobDetail&amp;jobPostId=6696&amp;localeCode=en-us&amp;utm_source=linkup&amp;utm_medium=referrer>",
    "label": "1"
  },
  {
    "text": "Question for the folks here. I am a junior developer looking for my first software job and I switched careers after working in Business development at a startup and as a business analyst. I graduated 2 years ago from in Information Systems. I have working proficiency in Python(Flask), Node.js, React and JS. In addition, I had 2 apps published to the app Store. I have been struggling to get any interviews and the only ones I got(2) I got rejected for not being experienced enough. Its been 3 months since I started the interview process.\n\nMy techniques are this:\n1-Reach out to software engineer/developer in the company I want to work for\n2-Reach out to them asking for advice via email/linkedin\n\nSo far, I haven't been getting very lucky with my responses. Is there anyone who can provide some help as to where I am going wrong and what I could do better. I have practiced enough coding questions and algorithms and feel comfortable if presented with a problem but so far havent been able to get to that point. Most of the jobs I apply are cold leads on the website since I moved to Toronto recently and dont know many people in software development roles",
    "label": "2"
  },
  {
    "text": "Yeah, but, a lot of work and data down the pipe, it makes the pure css/html or minimal js solutions look a lot more convenient in comparison.\n\nUnless I'm creating a very heavy custom element driven website. I find that having to deal with IE professionally for 7 years now, it's easier to keep things simple. I always regret it when I do compile down things and have polyfills and overengineered build process that I need to touch from a random project out of hundreds a few years later because the client had new medical/research data.",
    "label": "3"
  },
  {
    "text": "&gt; A regular expression, regex or regexp[1] (sometimes called a rational expression)[2][3] is a sequence of characters that define a search pattern. Usually such patterns are used by string searching algorithms for “find” or “find and replace” operations on strings, or for input validation. It is a technique developed in theoretical computer science and formal language theory.",
    "label": "3"
  },
  {
    "text": "you are looking for web frontend developer?",
    "label": "2"
  },
  {
    "text": "Hard to imagine myself in that position, so I'm not sure I can answer. What I will say is that any sane company is going to see you as more than \"a junior dev, but old\". There are skills involved in relating to other people, hearing what people aren't saying, understanding and critiquing business plans, etc, that a 23 year old just isn't going to have.\n\nThere's also probably some \"domain knowledge\" that you can bring over from a previous career. People who only know about programming are constantly solving nonsense problems, like an app to deliver gas to your car when you don't have time :eyeroll: . I think this is because it's difficult to meaningfully solve a problem you don't understand. When you come from another field (medical, restaurant, insurance, whatever) and _then_ learn to program, you can solve more important problems because you understand them better.",
    "label": "3"
  },
  {
    "text": "The only time I have ever looked at github or other online portfolios is for entry level positions when a candidate has zero or next-to-zero professional development experience. Fresh bootcamp grads, interns, etc. Even in those cases it’s not nearly as important as mindset / “soft” skills (I hate that term), just a way to get a quick gauge that someone has actually worked on an application of some kind",
    "label": "3"
  },
  {
    "text": "Happy Friday everyone! I'm a long-time fan of the Culture Amp blog and happy to finally be in this Slack community :hugging_face: I'm an employee communication &amp; organizational culture specialist. Most recently, I was at Business Insider/INSIDER where I built their internal communication strategy, managed the Ops &amp; Culture team, and stewarded their company culture. I'm starting 2020 off fresh and taking some time to finish my novel :sweat_smile: and find my new role at the perfect org. Looking forward to swapping insight with everyone!",
    "label": "3"
  },
  {
    "text": ":sunny:Looking for an awesome Software Dev Engineer 2 (C#/.Net &amp; .Net Core):sunny:\n2 year contract in Riverton, Utah (on-site)\nRequired Skills:\n• .NET Core and C# programming language\n• Web development using HTML/CSS, JavaScript and TypeScript\n• SQL Server \n• Agile SCRUM methodology\n*DM me for more info or to refer someone. I’d love to connect!*",
    "label": "1"
  },
  {
    "text": "It’s definitely very insulting. But as someone who’s been a hiring lead at my past 2 companies… shit happens! You have a panel of interviewers, all of whom are engineers with full schedules. You have to take some time every few weeks to prep for a candidate. At some point _someone_ is going to drop the ball and forget to read the resume of the person coming in on a Friday afternoon. I was that guy before and it feels awful. It’s definitely a bad mistake to make, but it happens (just like people fucking up production happens).",
    "label": "3"
  },
  {
    "text": "```\nAnnelise Hudson &lt;<mailto:Annelise.Hudson@workbridgeassociates.com|Annelise.Hudson@workbridgeassociates.com>&gt;\n11:03 AM (4 hours ago)\n to me\n\nHi there :Hope you've been well! \n\nI came across your background in my system - it's probably been a while since the team and I have spoken to you about a new positions. I have a new DevOps Manager position that I wanted to reach out to you about. I'm not sure if anything has changed in your search but here are the details:\n\nIt's with Flight Safety International – <https://www.flightsafety.com/>.\n\nThey are a Berkshire Hathaway company. The company provides aviation training for pilots, flight attendants, dispatchers, technicians and more! They work with Fortune 500 companies around the globe and they have the world's largest fleet of full flight simulators!\n\nThey are looking to hire a DevOps Manager to run the team of 5. The infrastructure is pretty mixed - they have Windows and Linux as well as Azure and AWS. Most of the applications are written in .Net and some Java. They are leveraging Docker Swarm, Kafka, Terraform and Prometheus. There is some legacy technologies - but 2020 is their year for digital transformation so there is a lot of opportunity here to make a big impact.\n\nThis role would be mostly managerial tasks - working with the engineers on their projects to get the best solutions and you will participate in code reviews. The ideal candidate would be an experience DevOps engineer that has recently been a manager.\n\nThe office is in Teterboro, New Jersey - but you only have to go into the office on Wednesdays. Occasionally there are other workshops on different days that you'd go in for.\n\nHow does this one sound? If you're interested give me a call at <tel:2122715100|212-271-5100>\n\nBest,\nAnnelise\n \n\nANNELISE HUDSON  | Recruiter\n\nOffice: <tel:2122715100|(212) 271-5100>\nEmail: <mailto:Annelise.Hudson@workbridgeassociates.com|Annelise.Hudson@workbridgeassociates.com>```",
    "label": "3"
  },
  {
    "text": "Hello! I’m a UX designer looking to see if there are any open junior roles based in the Bay Area. Thanks!\n<http://www.jaclynchao.com|www.jaclynchao.com>",
    "label": "2"
  },
  {
    "text": "I wouldn't bat an eye for a developer's personal site, speaking as a hiring manager",
    "label": "3"
  },
  {
    "text": "Hi Guys,\n\nI am actively seeking new jobs. I recently graduated from the University of Ottawa ( Masters in Eng.Management). I have 4 yrs of experience in IT primarily in development and leading teams. I am looking for opportunities in Business analysis or Project management/project coordination. I am open to entry level jobs, full time, part time , internships and even volunteer opportunities. I am even open to a conversation to help me steer my career towards it. Let me know if you’d like to take it forward ",
    "label": "2"
  },
  {
    "text": "Hi all, here's a teaser for a job description I'm expecting in a few days. My friend is looking for a junior-ish full-time software developer for a predominantly Windows based application for train/rail control systems. If you love trains and/or would like to make a big impact at a small company, this job is for you!",
    "label": "1"
  },
  {
    "text": "I think query times for similar packs and memory usage and looking for large deviations",
    "label": "3"
  },
  {
    "text": "We have heartbeat queries, that run roughly once every 5-10 minutes, which gives us a good idea of how many hosts we should expect and \"trends\", and then just look for deviations from those trennds",
    "label": "3"
  },
  {
    "text": "My daughter has been going through this for months. I don't get the sense that companies actually want free work from her. But they have completely unrealistic expectations about how much time she can devote to every opening.",
    "label": "3"
  },
  {
    "text": "So I’m ideally looking to join a team where everyone is more experienced than me so I can just learn more. I’ve found that I grow the quickest and most successfully when I dive right into something over my head and work through it. Hence looking for jobs above my current skill level that I believe I could get up to speed on. I can honestly say I wasn’t qualified for my past two positions, (I was up front and honest with both employers about that) but I grew so much more as an engineer by challenging myself to get up to speed",
    "label": "3"
  },
  {
    "text": "[Onsite][Toronto][Senior Software Engineer]\n:robot_face:Evisort is an AI-Powered Contract Management Platform that in the span of six seconds, the application can pull out key information from a 30-page contract. They are seeking seasoned engineers to help scale operations, meet clients' demands, and help develop a strong company culture moving into 2020. Their tech stack consists of Functionally Typed Python (Django/celery), js (react), deployed on AWS (S3, RDS, ElasticSearch).:rocket: Competitive salary, great benefits, and lots of perks. Bonus points if you are a fan of functional programming!\nInterested? Email <mailto:nicole@functionalworks.com|nicole@functionalworks.com> or click the link below! :blush:\n<http://bit.ly/38NZcX3>",
    "label": "1"
  },
  {
    "text": "Hi everyone! I'm a technical recruiter based in New York :slightly_smiling_face: I currently am recruiting for Evisort who are hiring Senior Backend Engineers in Toronto! Feel free to DM me if interested",
    "label": "1"
  },
  {
    "text": "I am working for OnGuard  and we are looking for a freelance iOS developer. We are Calgary based company developing a solution for Lone Worker. Most of us are working remotely.\n\nLet me know if you have any question. If you are missing some requirements, still reach me out :slightly_smiling_face:\n\niOS developer requirements\n• 4+ years professional experience in iOS mobile app development\n• Expert with Swift code writing\n• UI/UX - Create interfaces for exceptional user experience\n• Solid knowledge of:\n• iOS background fetch and location\n• Firebase and Application publications\n• Previous experience with GPS, NFC, gyroscopes, accelerometers, Bluetooth sensors, background and push notifications is an asset\n• Advantageous to have Twilio voice communication experiences\n• Able to work closely and collaboratively with the development team and product manager.\n• Work on bug fixing and continuous improvement of application performance.\n• Help maintain code quality, organization, and automation\n• Proficient understanding and use of code versioning tools\n",
    "label": "1"
  },
  {
    "text": "We continue to grow at Resilient Scale and are hiring for various roles. If you are an engineer experienced in any of the following disciplines, we should talk:\n• Site reliability engineering\n• Container security, hardening, and validation\n• Infrastructure automation with Terraform \n• Advanced Kubernetes development and operations\n• Cybersecurity in Kubernetes environments\n• Software engineering in Python, React, Node\n• User interface design (web-based)\n• Platform testing and validation\n",
    "label": "2"
  },
  {
    "text": "have a look at this part of the arangosh source: <https://github.com/arangodb/arangodb/blob/devel/arangosh/Shell/V8ClientConnection.cpp#L107>",
    "label": "3"
  },
  {
    "text": "Not to spoil the surprise... it looks just like Dev :rolling_on_the_floor_laughing: ",
    "label": "3"
  },
  {
    "text": "Hello! I am very interested in this event. I am trying to RSVP but the form says it doesn’t accept gmail addresses. I am a new developer and currently in first stages of my job search. ",
    "label": "3"
  },
  {
    "text": "I have been hesitating to dip my foot in here, but ...\n\nI'm afraid of ageism. I'm turning 52 this year (and yes, I shaved by beard, which had a bunch of gray in it). I'm a far better programmer than I would be a manager.\n\nI have felt the \"ageism\" of startups wanting young coworkers. I've felt it when start-ups think that hiring a young bootcamp grad for $80k/year would be able to contribute to my level _ever_, much less in the next few years. I've felt it when a CTO who hired me _almost didn't_ because he was afraid he couldn't manage someone with more experience than him. (And that was in my early 40s.) I've felt it even in Denver-area jobs that requested insane amounts of \"at home\" work to prove your skill -- something that a younger or unemployed developer might have time to do, but something that an older or _under-_employed developer wouldn't be able to complete.\n\n*But.* Demand for strong senior developers is high, and enough companies _don't_ fall into those traps that I haven't really had a hard time getting a job.\n\nSo does ageism exist? Absolutely. Does it exist to the point where a really strong developer (a really strong _male_ developer, at least) can't get a job? If so, I haven't hit that point yet.",
    "label": "3"
  },
  {
    "text": "Cumulus does have EVPN available for stretched L2 as well as their redist neighbor thing, but our use case is braindead easy with just basic L3 through bgp unnumbered and a couple of SVIs directly on the ToRs. Super easy to setup; very low maintenance; super cheap (in our case with the 1G edge). I do think the price delta starts to become less pronounced as you shift into 10G attach, as your Cumulus licensing cost is tied to the predominant link speed of the device, but could be worth a look if you're actually considering replacing the FEX setup.",
    "label": "3"
  },
  {
    "text": "spent some time working with developer tools in chrome yesterday, am continuing some work today and one thing i think would save some time would be to keep my current position in the element tab, ie. if i have opened several elements ie. (uncollopased) elements in the dev tools i want to preserve my view when page refreshes as opposed to collapsing all html elements after a refresh is triggered.\n\nis thing something i can toggle in a preference / setting somewhere? i looked through the dev tools settings but didn't see anything that popped out.",
    "label": "3"
  },
  {
    "text": "Hello Margo, I am a Full Stack Web Developer, with a background in JavaScript, MySQL, NoSQL, and AWS S3 currently looking for a start up to join. ALSO :+1: your last name is as cool as my first name!!",
    "label": "2"
  },
  {
    "text": "Hey,  Sai working as Programmer using python for Automation and Data Analysis. Looking forward on exploring python with web development and ML. ",
    "label": "3"
  },
  {
    "text": "Hi NYCTech, not sure if this is the right place,\nI am a sociologist researching professional trajectories of software engineers and developers living and working in NYC.  I don’t ask job-specific questions. I am interested in your professional journey and how you think about work and technology. Your answers are anonymous, and I do not use any identifying information, such as your name, where you studied, and where you work. If this is the place to ask, please send me a message and I can elaborate more.\nThanks!",
    "label": "3"
  },
  {
    "text": "Hello - looking for a Senior Java Developer to join us out in Sterling:",
    "label": "1"
  },
  {
    "text": "My team at *The Washington Post* is hiring for 3 product designers and a product design lead.\nProduct Design Lead (Site)\n<https://wapo.st/designlead>\n\nProduct Designer (Native App Acquisitions)\n<https://wapo.st/appacquisitions>\n\nProduct Designer (Site)\n<https://wapo.st/productdesigner>\n\nSenior Product Designer (Subscriptions)\n<https://wapo.st/srproductdesigner>\n\n*Please reach out to me if you have any questions or interested in applying.* I can make sure your application is put in front of the right people.",
    "label": "1"
  },
  {
    "text": "We are looking for a Senior [losowa technologia] Developer I see you have some experience with [losowa technologia] and [losowa technologia 2]",
    "label": "1"
  },
  {
    "text": "We are looking for a Senior *Back-end* Developer to help us shape our products for the future. I see you have *some* experience with *react.js* and *jira*",
    "label": "1"
  },
  {
    "text": "Then I’d probably hire the younger developer.",
    "label": "3"
  },
  {
    "text": "Hello All! We're looking to hire a Senior Software Engineer to build out a mobile app within an Angular 6+ and Ionic Framework. No experience with Ionic is fine as long as you have strong experience with Angular 6+ and TypeScript. Please email me at <mailto:cwong@myticas.com|cwong@myticas.com> if you're interested and I will personally be in touch with you!\n• Senior level Angular 6+/TypeScript Framework development experience\n• Work with Development Team, DBA Team, QA Team and internal business stakeholders to deliver software solutions within an Agile environment\n• Research, devise, propose and socialize software design with IT Development team\n• Work with Product Management team to understand and implement to UI/UX mocks.\n• Proficiency with Ionic development to develop mobile\n• A plus would be development experience with C#, <http://ASP.NET|ASP.NET>, and SQL\n",
    "label": "1"
  },
  {
    "text": "given that we have more positions open than we have developers in denver, I'd need some really hard evidence",
    "label": "3"
  },
  {
    "text": "Hi Andrew, I have an opening for a UX/UI engineer if you want to send me contact details. <mailto:Joe@skillspipeline.com|Joe@skillspipeline.com>",
    "label": "1"
  },
  {
    "text": "I have a contact looking for an awesome UX/UI Engineer job. He's a very smart and talented guy. Anyone know of any great gigs? I really want to make sure he finds a great place to work for, not just a job.",
    "label": "2"
  },
  {
    "text": "<https://hired.com/state-of-software-engineers#experience>",
    "label": "3"
  },
  {
    "text": "How would you like to engineer electronic products for space travel, defense, or the medical industry? If you've got experience in developing FPGA designs from concept to definition, DornerWorks has a position for you!\n\nJoin this team in Grand Rapids, MI as a Senior FPGA Engineer. Apply here: <https://www.thegravityapp.com/shared/job?u=1582227418&amp;id=8a78879f6f7dcd5e016fb4c30c835c58&amp;clientId=8a7883d062657d460162682d3dbd18b6&amp;v=9&amp;token=eyJ0eXBlIjoiZW1haWwiLCJ1aWQiOjIwNjA0LCJwcm92aWRlciI6ImJvdW5jZSJ9.VAdB-m8vWxGCxAIYQeWAcg1JY0E>",
    "label": "1"
  },
  {
    "text": "Hi YVR! For anyone interested in game development back east in the Nation's Capital, Snowed In Studios is hiring full time C++ devs in Ottawa. We’re a homey studio of 80 people and growing, backed by a megacorp. Benefits include working both on small, short-duration projects as well as multiple triple-A PC, console and mobile titles in a crunch-free zone – we cap our work week at 37.5 hours. We’re currently staffing several triple-A projects, and looking for many C++ game dev generalists, a C++ audio programmer, and a C++ developer with Flash expertise for a triple-A new IP (crazy but true). More info on our job postings is at <http://snowedin.ca/jobs>, or feel free to DM me for more info. Thanks!\n \n*Nigel A. Franks |* Senior Producer <mailto:nigel.franks@snowedin.ca|nigel.franks@snowedin.ca>\nSNOWED IN STUDIOS | <tel:6136563372|613-656-3372> | <http://www.snowedin.ca|www.snowedin.ca>",
    "label": "1"
  },
  {
    "text": "I'm looking at celery for the first time... and on a related note, I'm not into web dev at all\nfrom the celery docs:\n```Running something in the background. For example, to finish the web request as soon as possible, then update the users page incrementally. This gives the user the impression of good performance and \"snappiness\", even though the real work might actually take some time.```\ncould I please get an ELI5 for that?\nfrom what I understand... user sends a request to let's say load 20 images, we load 5 of them so it's a \"snappy\" response, and meanwhile load the other 15 in the background using celery, right?\nincremental page update means there would be another request coming in for the next images... right?",
    "label": "3"
  },
  {
    "text": "We're looking for android engineers at <https://www.caper.ai/>. We build smart shopping carts. This isn't your standard android app (lots of sensors, cameras, offline-first mindset, etc). More than happy to answer questions here or via email <mailto:joshua.katz@caperlab.com|joshua.katz@caperlab.com>\n\nLocation: New York, NY (Manhattan)\nHours: Flexible schedule, I work from home a few times a week.\nPerks: snacks, weekly lunch orders, yadda yadda all the standard stuff\nTech: Java, Kotlin, Dagger, Retrofit, RxJava, OpenCV, some gRPC, I've instrumented Loki/Prometheus into our devices so we can also get metrics from that from our frontend, etc. Lots of opportunity to influence, clean up, etc.\n\nNo one here is an android dev, we've all sort of learned as we've gone. This hire will be the go to person for android related questions and will help set standards, guide projects and cleanup, etc.",
    "label": "1"
  },
  {
    "text": "I guess this tests are new trend. Curious how they weed out false positives vs false negatives. Looks like a fairly competent Elixir developer can still fail it.",
    "label": "3"
  },
  {
    "text": "American College of Physicians in Philadelphia is hiring a mid-to-senior level Drupal developer (<https://www.acponline.org/about-acp/working-at-acp/jobs-at-the-american-college-of-physicians-acp>). This is mostly onsite, though most of our department works remotely two days a week; after a 90-day period, that would be open to the candidate as well. I've worked here for 5 years and absolutely love it. We are the membership association for internal medicine doctors; I spend all day writing software helping doctors become better doctors. In the next year we'll be focused on migrating our D7 sites to D8/9.\n\nACP also publishes Annals of Internal Medicine, which has during my tenure written articles declaring both gun violence and marriage equality (before Windsor) to be public health issues, and more recently published guidelines to help doctors better understand the unique health issues faced by transgender patients.",
    "label": "1"
  },
  {
    "text": "My only hangup with moving to Discord is that I already have Slack installed and use it for NashDev, work, and my side gig so Discord would be another app to add and I wouldn’t open it very often.",
    "label": "3"
  },
  {
    "text": "Everyone seems to be looking dev's with React experience so definitely the framework of choice. Vue is gaining in popularity as well",
    "label": "3"
  },
  {
    "text": "Fearless in Baltimore is looking for Ruby on Rails developers!\n\n<https://fearless.tech/careers/job?gh_jid=1993785&amp;utm_source=Twitter&amp;utm_medium=Social&amp;utm_campaign=January_SoftwareDeveloper_Ruby>",
    "label": "1"
  },
  {
    "text": "Hi Folks! One of my client a leader in home improvement industry is seeking a Devops/Linux Engineer to join their team in Cleveland, OH. This is full time direct hire position. The Senior DevOps Linux Engineer position is part of Platform Optimization team and has expertise on DevOps systems, processes and tools deployed in a Linux environment. He/she will engage closely with Global Infrastructure, Architecture, Oracle Database Administration, Oracle Engineered systems administration, Oracle Fusion Middleware Administration teams with a focus on leveraging automation and orchestration tools to improve operational processes and procedures. Feel free to reach out to me via DM or via email (<mailto:sumansingh@jscnexus.com|sumansingh@jscnexus.com>) to discuss further/learn more.",
    "label": "1"
  },
  {
    "text": "Looking for a Drupal developer who can build out drupal sites. Can look at someone with 1-2 years of experience or someone more senior in their career! <mailto:Stephanie.Cassle@hays.com|Stephanie.Cassle@hays.com>",
    "label": "1"
  },
  {
    "text": "Hi everyone! :wave:\n\nAt Zego, we're currently looking for back-end engineers to join us! :rocket:\n\nOur core application is built on top of the Django web framework and hosted on AWS. We typically use Python 3, Postgres, Celery, and whatever else we need to get the job done.\nWe're looking for people with a strong working knowledge of Python and a commitment to building, nurturing, and iterating on an ever-evolving codebase.\n\nIf you're interested or know of anyone that could be a great fit, don't hesitate to apply/share the role! Also don't hesitate to come and chat to me if you have any questions :smile:\n\n<https://apply.workable.com/zego/j/5E543A0FC9/>",
    "label": "1"
  },
  {
    "text": "Hey, are you open to hiring FT individual contractors or hiring from a dev shop, mate (<http://digitalogy.co|digitalogy.co>)?  <@U3PQR6ZRP>",
    "label": "3"
  },
  {
    "text": "[For][Hire]\n\n\nIf anyone looking for Python/Django/AWS developer , I am available to take the projects\n\nPlease DM me.",
    "label": "2"
  },
  {
    "text": "Hi All! If you or anyone knows a mid-senior data engineer who is looking to get to NY DM me. I’m supporting Madison Square Garden on a role and wanted to reach out to the DC network first.\nHappy Friday! ",
    "label": "2"
  },
  {
    "text": "Not sure if there is anything similar down with you, but I returned to work AND switched into tech by doing an apprenticeship up here in the North.  The first 18 months were on an apprenticeship wage though and quite tough financially and time wise with being in class 1 day a week and work the rest alongside the course work, but as soon as I got my permanent contract they bumped up the salary accordingly and I haven't looked back since. Almost 5.5 years in now and I've managed to work my way up to Senior Engineer as my previous lives gave me an excellent grounding in all those 'soft skills' needed, so have been able to focus un upping my technical game at every given opportunity, and I have to say the company have been amazing in supporting me through the minefield of figuring out what I want to end up doing in the industry,",
    "label": "3"
  },
  {
    "text": "Company: Whoppah\nRole: Senior iOS Developer\nFull-time: Yes\nRemote OK: No\nSponsorship: No\nContact: Hit me up on DM here\nLocation: Amsterdam\nRelocation Assistance: No\nBrief Description:\n\nWhoppah is the new marketplace for pre-owned design and art. Supported by the latest technology and highly-rated services. A place where you easily buy the ‘pearls’ that normally take ages to ﬁnd and you sell to an audience that is actually looking for your design items. With hassle free payment or transport. An experience that makes you go: Whoppah!\nWe are looking for a top notch iOS developer to grow our platform to the next level.\n\nAbout the Role:\n\nWe are looking for a top notch iOS developer to grow our platform to the next level.\n\nYour tasks\n\n● Taking the lead on mobile development for iOS, working closely with the Android team to ensure consistency.\n● Taking ownership of and further developing the iOS front-end technologies\n● Working closely with the back-end development teams to establish and maintain API connections necessary to operate front end services\n● Be responsible for accurate implementation of iOS technology requirements.\n● Help engineer the intercontinental iOS platform expansion plans\n\nWhat we expect from you\n\n● You have at least 5 years of iOS development experience\n● You are smart, pragmatic, organised and conscientious\n● You continuously strive to personally develop yourself, staying current all best practices and developments in iOS.\n● You love being part of a highly ambitious company\n● You are ready for an exciting growth journey\n● You speak and write English fluently\n● You are not a follower, you think deeply about tasks before implementing\n● You are passionate about quality in all aspects of your work\n● You are available full time\n\nCore required skills\n\n● 2+ years experience writing Swift code in a production environment. Well versed in Objective C.\n● Seasoned with UIKit, AutoLayout and Core Graphics. Both via storyboards and code\n● Practical experience with design patterns, MVVM in particular. We need someone who can write modular testable code\n● Strong practical architecture skills\n● Deep knowledge of algorithms with a track record of creating performant, high quality apps in the App Store.\n● Adept using Git\n\nAn ideal candidate would also have\n\n● Experience working with GraphQL, ideally with Apollo for iOS\n● Proficient in FRP with knowledge of RxSwift and RxCocoa\n● Familiar with CI ideally with Fastlane experience\n● JS in a NodeJS environment would be advantageous\n● Good knowledge with relational databases and/or document stores\n\nWhat we offer you\n\n● Very professional colleagues with various backgrounds\n● Challenging and ambitious goals to work on\n● Budget to expand your knowledge\n● Early access to great items for your home",
    "label": "1"
  },
  {
    "text": "Hello here at Nakshatra technology  we provide Digital Marketing service . In this we provide Social Media Marketing(SMM),Search Engine Optimization (SEO),Email Marketing,Google &amp; Facebook Ads,WordPress website development and much more.\n\nWe use trending tactics into our social media marketing with neat and creative post.Full SEO proof website PPC campaings and much more. \n\nFor more details:\nCall or whatsapp: 8390342089\nemail: <mailto:aditya.mahajan@nakshatratechnology.org|aditya.mahajan@nakshatratechnology.org>\nwebsite: <http://www.nakshatratechnology.org|www.nakshatratechnology.org>",
    "label": "2"
  },
  {
    "text": "Hey, are you open to hiring FT individual contractors or hiring from a dev shop, mate (<http://digitalogy.co|digitalogy.co>)?  <@UTXV493TM>",
    "label": "3"
  },
  {
    "text": "I have a friend that’s looking at moving into Software dev but going back and doing another 4 year degree isn’t really an option (nor totally necessary imo). Anyone have experience with doing this or know people that did? I’ll be their first port of call for help so any tips there would be appreciated :sweat_smile:",
    "label": "3"
  },
  {
    "text": "Are there any Junior .NET Devs in here that are looking for a position outside the City Centre? We have an opportunity near Bury.\nA SME with a family-run feel and a track record of internal development and promotion (I placed a BA in there 7 years ago, I know I don't look that old, and he is now Head of Operations) are looking for a Jnr .NET Developer who is eager to learn and wants to get stuck in.\nThey have a raft of projects from Legacy WPF that is being refactored to brand new React and .Net Core cloud projects.\nThey will pay you £30,000 if you have a little industry experience. 5% pension, medical and the holidays are 24 days from the start.~\nDM Me if your are interested.",
    "label": "1"
  },
  {
    "text": "Hey all! I'm looking for a React Native dev for a 45-day contract on an almost-greenfield app, with more opportunity to renew after that. Please DM me with availability and day rates, and I can give more details. No agencies please.",
    "label": "1"
  },
  {
    "text": "Also in the international category (we do visas), my team is looking for a designer <https://jobs.lever.co/hiring/37739a97-4284-4877-a56a-36604bb96562/>",
    "label": "3"
  },
  {
    "text": "| HiPeople | Berlin | Frontend Engineer |\n\nWe're a team of passionate founders, software engineer and a science lead building a software that makes hiring more meritocratic. And we're looking for a frontend engineer who loves building products us to join.\n\nInterested ? Ping me (<https://kodfabrik.com>) or drop an e-mail to <mailto:azer@hipeople.io|azer@hipeople.io>",
    "label": "1"
  },
  {
    "text": "I am looking for a Senior or Lead Python Web Developer to join our team at Alasco in Munich.\n\nAlasco is an ambitious and fast-growing start-up where we are transforming and disrupting the construction industry by digitalising the process of the construction planning &amp; execution phase with our cloud-based workflow platform with the mission to make higher quality &amp; affordable housing to society. Our founding team previously built one of the most successful e-commerce platforms in Germany and we are now looking to enter a hyper-growth stage, with plans to double in size this year. :)\n\nAt the moment, we are identifying top performers in the web development programming space, ideally, people that are experienced in Python Web Development to work in &amp; lead a small but growing team of talented engineers.\n\nThe team works on projects that incorporate a very open culture, short release cycles, continuous delivery as well as valuing high-quality code. The basic requirements are as follows;\n\n- Passion for programming\n- Strong experience in Python and Django or Flask\n- A good overview of Architectural Patterns, DevOps &amp; AWS\n- Any experience with Java, Docker &amp; PostgresSQL &amp; tech leading would be an advantage\n- Permanent employment basis, full-time in Munich with some flexible home office options\n\nThis is an exceptional opportunity as we offer an impressive workspace as well as using some of the latest technologies. Regular hack days, conference &amp; training budget, share options &amp; time for learning and the ability make an impact.\n\nIf interested please DM me!",
    "label": "1"
  },
  {
    "text": ":dawn: Dawn Health, based in *Copenhagen* :flag-dk:, is looking for an Android Developer :android:.\n:computer: Kotlin, MVVM and Android Architecture Components.\n:office: *On-site, Flexible schedule and Eventual remote option on request*\n:envelope_with_arrow: Send email or DM for questions and applications: <mailto:ebp@dawnhealth.com|ebp@dawnhealth.com>\n<https://dawnhealth.com/careers/android-developer>",
    "label": "1"
  },
  {
    "text": "Can't really post specs publically, but if you're curious DM me and I'll send you it right away. I'm looking for a Principal Java Developer, £65,000-£75,000 to work at a software house in Belfast. It's a US company that's engineered an AI driven application that automates manual tasks accross different industries. Interesting work at an established company that can even give you free parking  (yay).",
    "label": "1"
  },
  {
    "text": "You probably made a typo and are looking for a Go developer. GoLand is an IDE for Go, and golang is the SEO term for Go.",
    "label": "3"
  },
  {
    "text": "The best way to follow general discussion around Cordova is to subscribe to the dev mailing list: <https://cordova.apache.org/contact/> For the WKWebView topic you can look for issues and pull requests on Github in Codova iOS and subscribe to them manually. <https://github.com/apache/cordova-ios/issues?utf8=%E2%9C%93&amp;q=is%3Aopen+wkwebview>\n\nThis one is probably the interesting one <https://github.com/apache/cordova-ios/pull/781>",
    "label": "3"
  },
  {
    "text": "The first unicorn in Belgium is looking for somebody that loves and breaths observability, he would be joining the new started Site Reliability Engineering team in Brussels. Have a look at our Careers page and in specific the following <https://www.collibra.com/career-indv?gh_jid=1931568>\nLet me know in DM if you have questions as I am the hiring manager for this function. Don’t be shy to have a look also at our other careers and join this awesome story!",
    "label": "1"
  },
  {
    "text": "#Goleng <#C03UPABCA|poland> <#CQC3JQSUW|jobs-poland> Looking for Goland Developer in Poland. Work on your own business (PLN 9,000 - 13,000) or an employment contract. Possibility of total work at the Home Office.",
    "label": "1"
  },
  {
    "text": "Hello Folks! I am hiring couple of Golang Developer for a 6+ months contract position 6 Months with potential Contract to Hire. Our client is a global leader in healthcare technology. Please feel free to reach out to me at <mailto:ashleymccarty@jscnexus.com|ashleymccarty@jscnexus.com> for more information.",
    "label": "1"
  },
  {
    "text": "I am looking for a Gun DevOps Engineer (AWS) to work with an amazing local start in the Sports Tech industry. These guys are already 30 something in size and continue to grow off the back great initial success of their product.   More info here: <https://www.linkedin.com/jobs/cap/view/1744806020>",
    "label": "1"
  },
  {
    "text": "My daughter says that every iOS Memoji looks like a baby. But I say that nothing makes you _feel_ like a baby quite like trying to learn iOS development",
    "label": "3"
  },
  {
    "text": "We are hiring engineers in Santa Monica, just not on the package tracking or other backend teams. We will likely be hiring Go engineers there within the next year.",
    "label": "1"
  },
  {
    "text": "New podcast episode out now! Applying to jobs is always difficult, and being an entry-level developer seems twice as hard. Listen up for suggestions on how to prove yourself as a programmer when it comes time to job search. <https://anchor.fm/suitcase-coder/episodes/Prove-Yourself-eatltj> or watch on youtube: <https://www.youtube.com/c/suitcasecoder>",
    "label": "3"
  },
  {
    "text": "G’day everyone :wave: \n\nI’m looking for a Senior Web Developer for a client in Melbourne. They have been around for 15+ years and have a genuine focus on building solutions for government, NFP and corporate that actually help people and try to make difficult situations/events easier to handle. \n\nIn terms of tech they’re fairly agnostic - they’ve used stuff like PHP, Python, Node, React, AWS, Heroku, ElasticBeanstalk, Docker and more. \n\nThey’re continuing to grow steadily and have about 45 people in the office now. Plenty of opportunity to learn new things and step up into more responsibility. Dev team is about 12 or so and working on different projects in smaller teams. \n\nSalary is up to around $120k + super. \n\nSend me a message if you’d like to have a chat :blush:",
    "label": "1"
  },
  {
    "text": "Okay, since today is Boston-ish roles day: we’re hiring 2 embedded software engineers at iRobot for our Bedford, MA (just outside of Boston, MA, and very close to Waltham, MA) office. No remote, sorry (even though I’m remote. The irony is not lost on me.) <https://irobot.wd5.myworkdayjobs.com/en-US/iRobot/job/US-MA-Bedford/Principal-Software-Engineer_R1070>",
    "label": "3"
  },
  {
    "text": "Hi <@UU4D6R78V>, I've gone with Toastmasters. You can also hire an executive coach and ask them to help you develop your executive presence leadership presence. Just make the executive coach used to an executive.",
    "label": "3"
  },
  {
    "text": "I just encountered someone looking for a Docker / Kubernetes / DevOps gig. Was just laid off from Kohl's and is looking for his next job. Let me know if anyone has specific positions open. Local to Milwaukee, occasional travel to Madison area is okay.",
    "label": "3"
  },
  {
    "text": "Hey, I'm a Toronto based iOS developer looking to connect with the community. I've worked with various startups in the city and currently am working for League, the Health and Wellness Benefits company.\n\nLooking forward to chatting with you all!",
    "label": "3"
  },
  {
    "text": "what's your local development environment look like?",
    "label": "3"
  },
  {
    "text": "Hi All!!\n\nI have a Client in NYC looking for Software Engineers and Data Engineers specifically in the Finance industry. No C2C or Sponsorship.\n\nThey are looking to hire all levels of experience... they will play a key role in helping build the future of financial services, working hand-in-hand with business partners to create client experiences that are changing the way people invest.\n\nWe want technologists with a fresh perspective who are passionate about solving complex business, data and technical challenges.\n\nThey will work with smart, talented people across their business to create groundbreaking, next-generation applications for n-tier cloud architectures and also be involved, hands-on, through the entire development cycle.\n\n<mailto:ashley@dotconnectllc.com|ashley@dotconnectllc.com>\n<tel:9492466629|949-246-6629>",
    "label": "1"
  },
  {
    "text": "Are you hiring engineers in Santa Monica as well?",
    "label": "3"
  },
  {
    "text": "For anyone interested in game development jobs (we're hiring in Ottawa), there's a new channel <#CUCDK02SJ|jobs-gamedev>. We'll be posting our multiple open positions for C++ developers there in the coming days.",
    "label": "1"
  },
  {
    "text": "*Searching for: Progressive Web Application Developer*\n\nHello, \n\nWe are a Brooklyn based music start up, and are searching for a coder who can help develop a *progressive web application*. We are looking for an immediate hire who is experienced in developing websites and web apps and who is prepared to work full time. \n\n-Not remote\n-Salary is negotiable\n\nIf you are interested, please direct message me with a portfolio and resume,\n\nThank you!",
    "label": ""
  },
  {
    "text": "Hey everyone! My company is working on a suite to help fix the data quality challenges for multi-asset investors (endowments, foundations, family offices, etc). We're a small company based out of Waltham MA, pivoting from a prior lifetime working in the fund of funds space.\n\nWe're looking for a couple senior, fullstack developers to join us and like the idea of finding a couple more folks down here in the RDU area. We also have folks in Charlottesville (CEO) and Myrtle Beach (VP), so remote is normal for us. Our tech stack is React/Typescript/C#/dotnetcore/MSSQL/Azure. We're looking for folks that are motivated to learn the space, like to think about things form the user perspective, but also have some deeper proficiencies that are relevant for our stack or industry.\n\n<https://apply.workable.com/j/31BB9021F8>",
    "label": ""
  },
  {
    "text": "DaisyBill is seeking a designer to work collaboratively with the Product team to drive product design. This team member will help us craft beautiful, friendly, and consistent user experiences for our app. The Product Designer will report directly to the CTO and will work closely with product managers. Apply here: <https://www.daisybill.com/careers?gh_jid=4656067002> or reach out to me directly.",
    "label": ""
  },
  {
    "text": "DaisyBill is seeking a designer to work collaboratively with the Product team to drive product design. This team member will help us craft beautiful, friendly, and consistent user experiences for our app. The Product Designer will report directly to the CTO and will work closely with product managers. Apply here: <https://www.daisybill.com/careers?gh_jid=4656067002> or reach out to me directly.",
    "label": ""
  },
  {
    "text": "like you think you’re fine and then your dev decides that it’s time to make every message that a topic will handle be 30mb and that replication shouldn’t occur and btw were going to have static access methods so the cluster will always be unbalanced until you deploy because that’s going to cause the runtime to drop out which means that data won’t be requested from those nodes anymore and now kafka is rebalancing gigs of data you improperly stored",
    "label": ""
  },
  {
    "text": "TAG Resources, LLC is a technology company specializing in retirement services based in Knoxville, Tennessee. Our mission is to provide all employees the opportunity to retire—this means constructing better programs and tools to achieve a fully-funded retirement. We are currently pursuing PHP/Laravel/AWS developers with a desire to work in our offices on Deane Hill off Kingston Pike. We are looking for both Junior Developers, with little to no experience, as well as full Senior Developers with a lot of PHP/Laravel experience. Please contact me if you or anyone you know would be interested. Thanks.",
    "label": ""
  },
  {
    "text": "I don't have first hand experience but I did have a conversation with a co-worker on the topic a few years ago. He used to work at a medical records company that had access to millions of people's PII data (including social security numbers). The company had very strict monitoring and access control. So if one of their employees decided to look up information for say a celebrity for example... the employees' patterns of access would be flagged as unusual/suspicious pattern (based on timing and access history of retrieving those kind of records) and an internal alert would go off. He said he knew at least one employee who got found out and fired. I hear theres a lot of development going on for AI driven event detection for these kinds of security threats and privacy breaches. Lets hope Facebook are on top of it!",
    "label": ""
  },
  {
    "text": "Hi everyone, at Vastari we connect the cultural exhibition space and enable private object loans to world leading institutions as well as touring exhibitions around the globe. Our diverse art + tech team is looking for a brilliant Product Designer to join us asap. Please feel free to share our job post or DM me for applications and recommendations. Thank you",
    "label": ""
  },
  {
    "text": "*Indivisible* is hiring an *Associate Director of Data Engineering* who is eager to play both a key technical and leadership role on a results-oriented data team that delivers critical work for stakeholders across their organization.\n\nTheir mission is to cultivate a grassroots movement of thousands of local Indivisible groups to elect progressive leaders, realize bold progressive policies, rebuild our democracy, and defeat the Trump agenda.\n\nThis role will lead the data engineering agenda for the organization, working across departments to identify opportunities where data engineering can optimize program and/or provide efficiencies for their work.\n\n*Location: DC Preferred, remote optional.*\n\n*Learn more and apply here:* \n<https://www.techjobsforgood.com/jobs/2004/>",
    "label": ""
  },
  {
    "text": "Hi all,\n\nMy name is Genaro and I am currently on a job search. I majored in Electrical Engineering with a minor in CS. Most of my work experience has been more CS related. I am looking for a new software position. I have been working in the healthcare industry but I am open to others. I have experience creating applications for different platforms using python or C++. In my current role I debug issues for multiple production software and create tools to automate or assist service teams catch issues. If anyone has leads or help critique my resume I would appreciate it. Thanks!",
    "label": ""
  },
  {
    "text": "*Kinvolved* is the leading services and software organization galvanizing students, parents, teachers, leaders, and community members around a shared goal: To increase student achievement by eradicating chronic absenteeism.\n\nThey are currently hiring a *Director of Engineering* to join their team. If you’re an engineer in a leadership position looking to put your technical expertise toward social good, this job is perfect for you.\n\nLocation: *New York or Remote*\n\nLearn more &amp; apply: <https://www.techjobsforgood.com/jobs/1944/>",
    "label": ""
  },
  {
    "text": "*Kinvolved* is the leading services and software organization galvanizing students, parents, teachers, leaders, and community members around a shared goal: To increase student achievement by eradicating chronic absenteeism.\n\nThey are currently hiring a *Director of Engineering* to join their team. If you’re an engineer in a leadership position looking to put your technical expertise toward social good, this job is perfect for you.\n\nLocation: *New York or Remote*\n\nLearn more &amp; apply: <https://www.techjobsforgood.com/jobs/1944/>",
    "label": ""
  },
  {
    "text": "Hello everyone! Does anyone have any recommendations for resources similar to Windows Internals (<https://www.amazon.com/Windows-Internals-Part-Developer-Reference/dp/0735684189?SubscriptionId=AKIAILSHYYTFIVPWUY6Q&amp;tag=duckduckgo-ffab-20&amp;linkCode=xm2&amp;camp=2025&amp;creative=165953&amp;creativeASIN=0735684189>) but for macOS? I'm a security researching looking to dig into macOS security. Thanks in advance!",
    "label": ""
  },
  {
    "text": "Looking for a Security Engineer who has worked within an AWS environment. This person will be the second hire on the security team and will be the driving force of integrating security into their CICD pipeline. Additionally, this person will be working on creating the roadmap for the team and partnering with the head of security to understand which vendors will be great partners as they continue to scale. DM if interested in learning more",
    "label": ""
  },
  {
    "text": "I only hire specialists to help me with side projects, thanks though :slightly_smiling_face:",
    "label": ""
  },
  {
    "text": "Hey folks! My team at the Motley Fool is looking to hire 2 DevOps Engineers, either with prior devops experience or experience on the dev or systems sides looking to branch out. Feel free to DM for any questions / detail requests! The specific posting is here, but we have lots of other open positions, too!\n<https://careers.fool.com/openings/?p=job%2Fo4g5bfwk>",
    "label": ""
  },
  {
    "text": "Will look into establishing this as part of the dev process...",
    "label": ""
  },
  {
    "text": "I am looking for a presentation solution that works with video, PDFs, etc...  I’m looking for something that will allow one master device to control what is displayed across 6-10 additional iPads ",
    "label": ""
  },
  {
    "text": "Dot Net Developers of Atlanta! We are growing our team in Atlanta. *Mid and Senior level Full Stack devs needed* - all perm hire positions.\n\n*Location*: Sandy Springs\n\nMid level ~$105k, Sr. Level ~$120k.\n\n• Will be creating full stack, cloud-native applications\n• Looking for strong React experience. We make heavy use of AWS as well.\nWe have multiple openings for both, and do give $500 referral fee for any you send that lead to a hire. Would be happy to provide more formal JD upon contact.\n\n*Email*: <mailto:jeffery.hendrix@blueskyrs.com|jeffery.hendrix@blueskyrs.com>\n*Phone*: <tel:4045908709|404-590-8709>\n\nThank you,",
    "label": ""
  },
  {
    "text": "<#C1PR2J18A|developers-channel>  more appropriate. CDN, reduce number of files, reduce number of assets, look at network stats in Chrome/ Firefox",
    "label": ""
  },
  {
    "text": "Hello Denver Devs! I am an IT Recruiter new to the Denver market. My company, Bluesky Resource Solutions, places all levels of talent in the Denver area. Please don't hesitate to reach out if you are seeking placement locally. I also work in the Atlanta market.",
    "label": ""
  },
  {
    "text": "Good evening Denver Devs!\n\nI'm looking for *Front End developers* with strong React experience. Offices are in Superior area.\nTwo full time positions:\n\n*Sr. Developer* - Up to $125k. Would consider someone super strong with Angular who wants to go further with React.\n\n*Lead Developer* - Up to $155k. The lead is more of a champion of processes than people - 100% coding.\n\n*Team size* is ~15, with 6-7 devs, a Product Owner, and the rest QAs.\n\nWould be developing all day, every day with a focus in React and React Native.",
    "label": ""
  },
  {
    "text": "Hey there friends,  I am about to start going through the global campus front-end class that starts in March focus I believe will be Angular,  I know it is early, but I am starting to think about the project for demo day... they bring in a lot of local companies to view and ask questions about our final projects, so I want to make sure I have a well thought out and developed project to represent myself..  just so I can start getting it all lined out... obviously the more I learn the more I can build, but starting with a skeleton at least allows me to think how to apply what I am learning.  Not looking for anyone to design my project, but what are some good idea's for projects that will appeal to local companies.",
    "label": ""
  },
  {
    "text": "A few weeks ago I applied for an entry level Front End position at a large company. The job posting requirements were HTML, CSS, experience with JavaScript preferred, and a \"strong desire to learn to code\". After a 30 minute online test and a phone interview with HR last week, I just finished a 30 minute phone interview with the team lead. They were looking for a senior Angular developer with strong Java skills hahaha. I guess some wires got crossed. Once the confusion ended it ended it was a pretty fun chat.",
    "label": ""
  },
  {
    "text": "hey all, minor update. when you refer someone to join us here on slack via our website, we added a short popup to have incoming users read our Code of Conduct before signing up.\nLike any ecosystem, from time to time, you see us admins step in when needed, but otherwise our slack here has been as we would hope it would be; a great community to be a part of.\nTo the Code of Conduct, we added a short paragraph about hiring, which we have been adhering to for awhile, but as was pointed out wasn't listed specifically on our CoC. The specific section that's been touched can be seen here: <https://knoxdevs.com/about/#hiring>. If you have any feedback, you can reply here.",
    "label": ""
  },
  {
    "text": "<@U7K6P4T3N> I went back through my code to find the formal references and it looks like this is documented  on the Intel Software Developer's Manual, Volume 3, section 8.2.3.4 \"Loads May Be\nReordered with Earlier Stores to Different Locations\"",
    "label": ""
  },
  {
    "text": "I think the best thing to do in that case is to show how much more you can do. Get allies in Security and Engineering. If you are opening new offices, deploying things like Zoom Rooms can be nearly fully automated with Jamf. The fewer things you have to do manually, the more overhead service desk has. Even if your numbers are good now, MDM can slow future hiring and save money down the road",
    "label": ""
  },
  {
    "text": "not so much a devops guy, but i might be looking in coming months if my work won't let me go remote to relocate",
    "label": ""
  },
  {
    "text": "Hey all! With our recent acquisition of POPSUGAR, our data and insights needs have grown, so we're looking for an experienced Data Engineer to join our data insights pod here in NYC! You'd be making a huge impact here, working alongside our engineering, data design, and design team!\n\nPeep the job description below. Thanks and good luck with your current search!\n\n<https://boards.greenhouse.io/groupninemedia/jobs/2087993>",
    "label": ""
  },
  {
    "text": "Hmm after a little research it seems like they’d probably have to mess with all the shell configs. Can you modify a set and then push the same config to all devices?",
    "label": ""
  },
  {
    "text": "There are sooo many contextual things to consider when responding to your request, but I'll give some advice:\n\nIf you are looking for a job or internship position and the resume is the key requirement for the application process, I recommend framing your resume specifically for that position. Your resume currently showcases strong eduction and engineering experience, but doesn't read very well regarding PM experience or desire to gain additional PM skills.\nhope that helps :slightly_smiling_face:",
    "label": ""
  },
  {
    "text": "Piano is hiring a Business Development Manager in our Philadelphia office (conveniently located in the Bourse). You can check out the job description here: <https://hire.withgoogle.com/public/jobs/pianoio/view/P_AAAAAACAAEeBIJlZltRnZd>\n\nShare with friends! :slightly_smiling_face:",
    "label": ""
  },
  {
    "text": "in my current role, i was hired on as QA lead and ended up also serving as de facto devops lead until a couple months ago when we brought on a dedicated person to manage moving everything to Azure native tools",
    "label": ""
  },
  {
    "text": "We have an unnecessarily restrictive environment in some ways. But, we also have Azure credits from msdn, and RDP is allowed. So, most of the developers have a VM outside the network for looking stuff up and some actual work tasks.",
    "label": ""
  },
  {
    "text": "Hey everyone, I'm looking for someone to do rails front end development for a short term subcontracting need",
    "label": ""
  },
  {
    "text": "Looking for interns? _(and/or fresh talent in the form of passionate junior software engineers?_ *DigitalCrafts* :wrench: has begun a new internship program to facilitate opportunities for each coder who comes through our program and on the flip side, provide low cost solutions for companies looking to hire fresh, quality talent.  :muscle::skin-tone-3:\n\nWe'd love to hear from you! DM me if you're interested in talking a bit more about our internship and/or hiring opportunities :face_with_cowboy_hat:",
    "label": ""
  },
  {
    "text": "FWIW, I *was* hired as the endpoint guy (official title is MDM Administrator).  We were at ~375 Macs and 120 iOS devices when I started 3 months ago, as of today we're at ~ 475 Macs and 175 iOS devices, so growing fast.  Multiple Jamf instances, setting up and managing management platform for the ~50 or so Windows systems, establishing change control practices, etc.  Significant focus on security, very mobile workforce spread across 4 countries and at least 1/2 dozen cities, etc.",
    "label": ""
  },
  {
    "text": "USA - Contract - Sr. C# (posting for a friend with a Navy contract)\n&gt; I am looking for a software developer who is very experienced in C# and XML. It would be short term of a few months. The task is to take in XML files, parse them and present information on the content of the elements and attributes in a summary report to the User.\n<mailto:ron.taylor@summittests.com|ron.taylor@summittests.com>",
    "label": ""
  },
  {
    "text": "USA (anywhere except CA due to AB5), posting for a friend with a Navy contract:\n&gt; I am looking for a software developer who is very experienced in C# and XML. It would be short term of a few months. The task is to take in XML files, parse them and present information on the content of the elements and attributes in a summary report to the User.\n<mailto:ron.taylor@summittests.com|ron.taylor@summittests.com>",
    "label": ""
  },
  {
    "text": "Hi everybody, posting here on behalf of a friend with a Navy software development contract.\n&gt; I am looking for a software developer who is very experienced in C# and XML. It would be short term of a few months. The task is to take in XML files, parse them and present information on the content of the elements and attributes in a summary report to the User.",
    "label": ""
  },
  {
    "text": "My team is hiring :smile: <https://jobs.apple.com/en-us/details/200147980/product-designer?team=DESGN>",
    "label": ""
  },
  {
    "text": "Is there something I can run locally via r10k to read my Puppetfile and populate modules/ with all the right versions in my dev environment? Running into that probably where I have 15 modules in there and just want one place to look rather than maintaining all the checkouts.",
    "label": ""
  },
  {
    "text": "Awesome thanks <@UTZ60CUQ0> --- I've hired 4 devs for them so far, and ALL (so far) have been RoR folks making the transition to Elixir, so he could be a great fit.",
    "label": ""
  },
  {
    "text": "Long shot since this is a Denver channel, but anyone w/ experience or interest in Functional Programming, I've got a client in Atlanta that's hiring Full Stack Elixir Devs as they sunset their RoR app and build a greenfield application with Elixir and React using Microservices. I don't see many Elixir roles, so thought I would share.  \n\nIf you're interested in this role, or just want to chat with a local recruiter who actually gives a shit about you / your goals / your company happy to connect! Other roles I'm focusing on RN are Full Stack Javascript (Node/React) and Full Stack RoR w/ React :) Send me a connection request on LinkedIn and then an email and/or text and we can set up a time to chat. -- I'll be at Node.js Meetup tonight too if you wanna connect in person. Bald guy, red sweater. \n\nWill Wegert\nLinkedIn: <http://www.linkedin.com/in/willwegert|www.linkedin.com/in/willwegert>\nEmail: <mailto:will@talentsolvers.com|will@talentsolvers.com>\nCell: <tel:7207721739|720-772-1739>",
    "label": ""
  },
  {
    "text": "Airrosti is looking for a midlevel fullstack C# dev. <https://www.appone.com/MainInfoReq.asp?R_ID=2897853&amp;B_ID=83&amp;fid=1&amp;Adid=0&amp;ssbgcolor=17143A&amp;SearchScreenID=1200&amp;CountryID=3&amp;LanguageID=2&amp;InternalJobCode=146945>",
    "label": ""
  },
  {
    "text": "looking for engineer for key  openings here at <http://Terminal.io|Terminal.io>  - my email <mailto:mark@terminal.io|mark@terminal.io>",
    "label": ""
  },
  {
    "text": "<@UMET4EK8D> Is that position name wrong? Looks like an engineer role, not Talent Acquisition Consultant.",
    "label": ""
  },
  {
    "text": "Airrosti is looking for a Fullstack C# dev",
    "label": ""
  },
  {
    "text": "Hello!\n\nWe’re looking for an Associate Developer to join us at Sainsbury’s Tech in Manchester. Quick info:\n• Salary around ~25-35k.\n• Joining an existing team working on new stuff - building out a set of new services and applications to drive our Groceries Online delivery systems.\n• Ideally a bit of Java knowledge would be great, but behaviours much more important - we really value a strong sense of empathy, collaboration/communication and a genuine desire to learn.\n• Lots of opportunities for growth &amp; development - 2 days/mo personal development time, tons of training and a very experienced team to pair/mob with and learn from.\n• A ton of cross-team stuff to get involved with, including shared platform work with Kubernetes, Lightning Talks, regular internal meetups, hackathons and lightning talks.\n• Strong support for good engineering and agile principles/practices.\nIf you’re interested in more about how we work and what we work on, there’s a bunch of stuff on our blog as well: <https://medium.com/sainsburys-engineering>\n\nHappy to chat in more detail if anyone has queries/questions!\n\nMore details here: <https://sainsburys.jobs/search-apply/associate-engineer-java--408209/>",
    "label": ""
  },
  {
    "text": "<@UJLC5B18A> Not knowing your company, here’s where I’d probably start:\n• Put digital tools in place for remote user research. I can’t give away all of my secrets here because I’d be putting myself out of a job.\n• As needed, hire remote contractor researchers to conduct the research and participate in the analysis of said research. They’ll understand the local culture, language, and context, leading to deeper insights. They will be cheaper than flying across the world. Plus you’ll be consulting someone who is trained to do this.\n• Intercept surveys\n• Listen to call center calls\n• Talk to other people who talk to your customers (sales, call center, etc.)\n• Social media\n• I could go on, refer back to #1 about not working myself out of a job :slightly_smiling_face: \nUX researchers love “democratizing” research and empowering PMs and designers to do research, but without consulting a UXR, you could be leading yourself down an expensive and misleading path. Untrained designers will often write interview questions that are completely leading, for example. I really can’t encourage you enough to consult an expert with the proper credentials. Thank you for coming to my TED talk!",
    "label": ""
  },
  {
    "text": "I love this discussion! This is something that has evolved over the past six years for me, but I'm glad to hear that QA/Devops synchronicity is a welcome practice in the software industry. And, it's also good to know what others are calling this position, as I keep my eye out for future opportunities",
    "label": ""
  },
  {
    "text": "I keep looking for deep insights to write long form articles about. Here i find out I can write “Check it out, python supports OO development!”",
    "label": ""
  },
  {
    "text": "*Onco360 is looking for a Software Engineer to join our IT Team!*\n \n*Onco360 Pharmacy is a unique oncology pharmacy model created to serve the needs of community, oncology and hematology physicians, patients, payers, and manufacturers. Our Onco360 corporate office is Louisville, Kentucky has an immediate need for a Software Engineer.* \nRequirements: Hands on experience in building, maintaining software, web and windows apps, web services, source control; version control; testing, production turnover; Experience with C#/VB.Net, Visual <http://Studio.Net|Studio.Net>, SQL Server, JQuery, JSON, LINQ- Direct message me for more info! Great people",
    "label": ""
  },
  {
    "text": "Looking for a Android developer for TO CAN - working with Kotlin and Java both - email me at <mailto:mark@terminal.io|mark@terminal.io>",
    "label": ""
  },
  {
    "text": "Hi everyone,\nWhat are the most useful user research skills for designers? We asked a couple of UX Researchers, Head of UX and Research about this topic and they came up with some really good thoughts. I think this piece will be useful for any designer trying to get closer to user research: <https://www.hellopingpong.com/blog/ask-the-network-what-are-the-most-useful-user-research-skills-for-designers>",
    "label": ""
  },
  {
    "text": "Hi everyone,\nWhat are the most useful user research skills for designers? We asked a couple of UX Researchers, Head of UX and Research about this topic and they came up with some really good thoughts. I think this piece will be useful for any designer trying to get closer to user research: <https://www.hellopingpong.com/blog/ask-the-network-what-are-the-most-useful-user-research-skills-for-designers>",
    "label": ""
  },
  {
    "text": "Hi everyone,\nWhat are the most useful user research skills for designers? We asked a couple of UX Researchers, Head of UX and Research about this topic and they came up with some really good thoughts. I think this piece will be useful for any designer trying to get closer to user research: <https://www.hellopingpong.com/blog/ask-the-network-what-are-the-most-useful-user-research-skills-for-designers>",
    "label": ""
  },
  {
    "text": "We are looking for Android Developers for Canada working with \" Kotlin' AND Java ......email me at <mailto:mark@terminal.io|mark@terminal.io>",
    "label": ""
  },
  {
    "text": "hi all, we are a software development agency looking for a business development partner to expand operations in the USA. I look forward to discuss possibilities on direct messages",
    "label": ""
  },
  {
    "text": "make sure you have error reporting on when developing :slightly_smiling_face: it would have given you more details than just \"500 error\" without looking at logs",
    "label": ""
  },
  {
    "text": "MESD is looking for a Application Developer.\n\nWe write web applications using ReactJS Front-ends and GraphQL Back-ends supporting local area schools, health programs, and for contracts with the State of Oregon and other regional bodies.\n\nPlease see the full job details at the following URL: <https://multnomah.tedk12.com/hire/ViewJob.aspx?JobID=4005>\n\n*About Multnomah Education Service District*\nMultnomah Education Service District is an educational cooperative that provides a wide variety of programs and services on a regional basis to school districts in Multnomah County and beyond. MESD is one of 19 ESDs in Oregon.\n\nEvery student we serve benefits from a safe and supportive learning environment where they receive personalized, creative, equitable, and cutting-edge education, health and technology services.",
    "label": ""
  },
  {
    "text": "The Golden State Company is hiring a mid-level Designer in Atlanta, GA.\nDM me directly if interested.\n<https://goldenstate.bamboohr.com/jobs/view.php?id=33>",
    "label": ""
  },
  {
    "text": "Ok this just happened at my friends company and i needed to share it with someone who would understand:  “The cmo just hired a print designer who had a fit about orphans on responsive sites.”",
    "label": ""
  },
  {
    "text": "Prometheus Research is looking for Full Stack Engineers (Python/PostgreSQL/JavaScript/React) for our Healthcare Registry Software Platform. Headquartered in Downtown New Haven, but a remote-first company. If you have questions, feel free to reach out to me. <https://www.indeed.com/viewjob?jk=41aaf46a18855efb&amp;tk=1e1hjpjlu4t8m801>",
    "label": ""
  },
  {
    "text": "Any Ruby on Rails Developers located in the NYC area out there? I have a client that's urgently hiring! :grin:\n\nNo C2C or sponsorship.",
    "label": ""
  },
  {
    "text": "I had some issues with the graphql plugin due to self developed plugins. The graphql plugin trows an error 'Cannot find the controller's action'. I had some look at the root cause and think the implementation in line 150 in <https://github.com/strapi/strapi/blob/master/packages/strapi-plugin-graphql/services/Query.js> is buggy:\n```        const controllers = plugin\n        ? strapi.plugins[plugin].controllers\n        : strapi.controllers;\n\n      // Try to find the controller that should be related to this model.\n      const controller = isSingular\n        ? _.get(controllers, `${name}.findOne`)\n        : _.get(controllers, `${name}.find`);```\n I changed it to\n```      const controllers = plugin\n        ? strapi.query(name, plugin)\n        : strapi.query(name);\n\n      // Try to find the controller that should be related to this model.\n      const controller = isSingular\n        ? _.get(controllers, 'findOne')\n        : _.get(controllers, 'find');```\nand it works",
    "label": ""
  },
  {
    "text": "I (the designer) am suppose to improve the search functionality of one my products store but there's just too many products and I think it'd just be prudent to instead just use ML and scan our product images.",
    "label": ""
  },
  {
    "text": "My company is hiring for lots of roles, but one that’s near and dear to my heart is this one: <https://stsiinc.com/careers/?gnk=job&amp;gni=8a78859e7009098c01705f4b969a1c73&amp;lang=en>\nTLDR:\n• Make high-profile, public-facing APIs &amp; UIs to share data with the public\n• Full TypeScript tech stack + Elasticsearch, with some heavy data engineering \n• Arlington + partial remote\n• Lots of positive impact internally showcasing modern dev practices\n• Technical leadership role with a good team\n• Government customer, so does require public trust clearance (pretty simple, not Secret)\nDM me if this might be great for you.",
    "label": ""
  },
  {
    "text": "<@U9DFURFB8> “Director of Engineering Productivity” so far most accurately describes what I have in my head, thanks!  Though I’ve never heard of it before.\n\n<@U0M4BCFST> The thing is, we already have a separate “infrastructure” team which is focused mostly on networking, security, and compute resources.\n\nAt a previous job we had someone who was head of the software factory, although that included software development, release management, and other things out of scope of the position I’m thinking of.",
    "label": ""
  },
  {
    "text": "Hi there, Game Developers! I run a Meetup for a local bar's game night. I'd like to feature a local game developer at the game nights. I'd like to have them come in and teach their game to some participants and let them play it. They could bring their game to sell. In the Meetup post for that week, I could link to their site and their game and talk about it. Is anyone interested in coming to the next or a future game night? I'll put a calendar and more information in the thread. I'll also put a link to the opening night event when we featured our first developer. Thanks so much!",
    "label": ""
  },
  {
    "text": "Ready for a new challenge? E84's needs help! We're looking for a Sr DevOps / Cloud Engineer to help wrangle remote sensing and life sciences data in the cloud with tools like AWS. We're an AWS Advanced Partner and work closely with them to build solutions to challenging problems.\n\nAnd yes, you can be remote! :slightly_smiling_face: Please use this link to apply <https://smrtr.io/3ThbK>",
    "label": ""
  },
  {
    "text": "Hello everyone! Thanks for letting me join this group. I'm based in Charlotte and I'm a Sr. Data Scientist &amp; Software Development Lead. Looking forward to learn from you all, have fun and perhaps share some knowledge and experience with everyone. :slightly_smiling_face:",
    "label": ""
  },
  {
    "text": "Hi all,\n\nThe company that I work for is organizing an event which might be interesting for some of you - the *Open Doors Android*. We'll fly 30 mobile devs with Android skills to Hamburg *(For Free)* :slightly_smiling_face: in order for you to meet several companies face-to-face - go to their offices, network, do some interviews. The idea is to *get hired* by them after the visits so it is for people who are thinking about moving to Germany and seeking exciting job opportunities.\n\nIt will take place between 28-30th April and is available for people residing in a country in the territory of Europe (all of Europe, Russia, Turkey, Ukraine, etc. included). You can find the full list and requirement in the page below. Applications are open until 13th of March, there are still some spots, so submit your applications asap to guarantee a spot!\n\n<http://bit.ly/2vM97Oy>",
    "label": ""
  },
  {
    "text": "Hello All. I have three Sr. level Java Development roles and one Product Architect role available in the Alpharetta area. All are Permanent openings. We are looking for folks with _Drools BRE_ experience, it is a hard requirement but does not have to be recent. $130k plus bonus and good benefits. DM me if interested in learning more.",
    "label": ""
  },
  {
    "text": "Square is hiring in Atlanta, and not just for product team roles! <https://jobs.smartrecruiters.com/Square/743999707186110-software-engineer-cloud-foundations> (shows primary location of St Louis, but Atlanta is also an option for this role)",
    "label": ""
  },
  {
    "text": "Hey y'all! I'm a new dev who moved to Utah a few months ago to do Dev Mountain and I feel like I learned a ton and am still currently in the job search \n\nNow I know that's not a unique situation nor is being a grad from a bootcamp that special either\n\nSo I wanted to ask yall what would help me stand out as an applicant? \nWhat's unique or something you wish your Jr. Dev knew??? \nWhat's the best way to find start ups?\nAny tips for this wide eyed new dev??? \n\nI'm sure y'all are super busy but get back to me or dm me if ya can!",
    "label": ""
  },
  {
    "text": "Hi everyone! I'm a recent bootcamp grad and full-stack developer looking for opportunities in Denver. \n\nI moved to Denver from Chicago a month ago and spent the last 3 months in Barcelona studying front and back-end development with Le Wagon. Before making this career change, I spent 6 years in advertising as a Marketing, Analytics and Data Consultant. My interests include learning languages [programming &amp; human], teaching Pilates and connecting through tech and fitness.\n\nI look forward to connecting with you and learning more about your career paths. Feel free to reach out directly if you'd like to grab coffee. :coffee:",
    "label": ""
  },
  {
    "text": "What type of feedback? Lattice is good for basic engagement stuff. If you’re looking for something more like 360s or development feedback, I’d go a different route.",
    "label": ""
  },
  {
    "text": "Looking for a Ruby on Rails developer with 3+ years of experience, 100% remote company.  Full time, US Based is my preference, will consider full time contractors outside the US that *live in US time zones*.  Details: <https://spokane.craigslist.org/sof/d/spokane-ruby-on-rails-developer/7074821323.html>",
    "label": ""
  },
  {
    "text": "I’ve been hired to do QA automation in almost all of my jobs, but have often ended up doing DevOps and backend dev as well, but honestly, I prefer being able to wear multiple hats",
    "label": ""
  },
  {
    "text": "Looking for a Ruby on Rails developer with 3+ years of experience, 100% remote company.  Full time, US Based is my preference, will consider full time contractors outside the US that live in US time zones.  Details: <https://spokane.craigslist.org/sof/d/spokane-ruby-on-rails-developer/7074821323.html>",
    "label": ""
  },
  {
    "text": "Not my posting; posting for a friend. Looking for an engineer to do data acquisition and analysis at NIST: <https://www.usajobs.gov/GetJob/ViewDetails/560111800>",
    "label": ""
  },
  {
    "text": "Zesty are looking for a .NET developer\nExperience with Kentico and/or  Umbraco helpful, SQL Server and basic HTML,CSS &amp; JS also desired.\n\nRead more and apply <https://wecodeni.com/jobs/simply-zesty-software-developer>",
    "label": ""
  },
  {
    "text": "Welcome everyone :wave::skin-tone-3:\nI hope you’ll find the help that you need on DevChat and looking forward to seeing you interact with other members :slightly_smiling_face:",
    "label": ""
  },
  {
    "text": "Hello, I am looking for a company that needs a Junior DevOps or someone who needs a help from a Junior DevOps as I would like to get more experience, other than what I practice at home. I could start with small backlog tickets and help as much as I can. For more details please PM me.",
    "label": ""
  },
  {
    "text": "Hey everyone, we're hiring an Software Engineering Manager for our organization. Apply if interested or share with a friend! <https://generateimpact.com/openposition2020/>",
    "label": ""
  },
  {
    "text": "Was hired to do fullstack web dev, ended up doing company-wide technical leadership/architecture, executive team member, some product management, marketing, fullstack web dev, ...",
    "label": ""
  },
  {
    "text": "one downside of the dev console is when I work on a design and somebody is looking over my shoulder and we're trying things",
    "label": ""
  },
  {
    "text": "design patterns(MVVM), data binding, etc., but I would start with some kind of server-client application(look for open API, e.g. twitter's API), so you can learn different kinds fo Android development aspects, like networking, databases, multithreading, etc.",
    "label": ""
  },
  {
    "text": "Just to reiterate, We're looking for a developer who is local, and can be in the office for at least 3 days per week. Thanks",
    "label": ""
  },
  {
    "text": "All the engineers tell me there's no difference between frameworks. All the clients tell me that there's no way they can hire x framework person into y job. :shrug::skin-tone-2:",
    "label": ""
  },
  {
    "text": "Hey everyone! :wave:\n\nAre you looking for an ultra-sharp, fast and reasonable-priced designer-duo? :art: :sparkles:\nI’m currently transitioning into doing more freelance gigs together with my fellow creative partner!\n\nWe are experienced within these areas:\n:point_right::skin-tone-2: Concept Development\n:point_right::skin-tone-3: UI &amp; UX Design\n:point_right::skin-tone-4: Visual Identity &amp; Branding\n:point_right::skin-tone-5: Animation and Video-editing\n:point_right::skin-tone-6: Social Media &amp; Marketing Strategy\n\nAs you can see we are quite multidiciplinary - which comes from years of making our own digital projects, bringing them to market and having worked for some years in the “agency-world”.\n\n:love_letter: Don’t hesitate to send a DM for examples of work!\n:moneybag: We do both project-based pricing and hourly rates, depending on the type of project.\n:flag-dk: Danish but currently based in Sweden. (We are level 100+ in doing Hangout’s).\n\nKindly, Daniel Bech &amp; Casper Nielsen",
    "label": ""
  },
  {
    "text": "*Senior Java Engineer (Java/Spark)*\n\n\n\n\nSignify Technology has officially started working with a company that has just received huge funding and is looking to upscale as they are doing building out their product in the Security Data space. \n\n\nThey are looking for Senior Developers to take on the responsibility of the most recent stage in the development of their product, incorporating the newest ideas and features.\n\n\n\nThey are expecting high-level design decisions and tech recommendations from your strong background in software development. \n\n\n The company is 100% distributed so you will be working remotely and partnering with your fellow colleagues across the EU and US. On offer: \n\n\n- High Rates \n- Long Term contracts (6-12months+) with extension \n- 100% Remote working \n- Flexible working. Choose your own hours \n\n\n The ideal candidate will have; \n - 8+ Years commercial Java experience \n - Expert in Spring frameworks and Spring Boot apps \n - DevOps knowledge; Kubernetes, Cassandra, Docker, and Kafka \n\n\n - Desirable - Knowledge of Kotlin, JavaScript (Node.js)\n\n\n3x Stages\n- 1st Call with Head of engineering \n- 2nd Tech test (3-4hours and paid $100)\n- 3rd Call with CTO\n4th OFFER",
    "label": ""
  },
  {
    "text": "A bit delayed here, but Etch in Southampton have some London vacancies but they may also be hiring in Southampton <https://www.etchuk.com/careers/backend-developer>",
    "label": ""
  },
  {
    "text": "Hi McrTech, been an extremely busy week for me with multiple jobs going live.\n\nSo sorry for the long list of jobs ahaha! So here goes!\n\n*Job 1*\n\n_Software Developer required for a start-up Ecommerce platform revolutionising their sector._\n_ _\n_Every wondered why people don’t follow through and complete their purchases?_\n_How much weight do customers put on positive reviews?_\n_What is the most efficient way to make a purchase?_\n_Do real-time messages (“12 people in your area are watching…”) actually encourage more people to buy?_ \n_ _\n_As a Software Developer within this business you will be specifically working on the basket &amp; checkout functions of this high-traffic web application._\n_ _\n_Not only will you be required to be a strong Software Developer with a commercial React background, you will also need to have a great blend of analysis and business acumen to be able to identify what works and why._\n_ _\n_They want to further improve the customer journey, whilst increasing the purchase conversion rate. These decisions and improvements will be powered through the use of Data Science and industry knowledge and A/B tested to see their impact._\n_ _\n_The technology stack you will be working with is incredibly fluid, however their main choice of languages and tools include:_\n_ _\n_React, Redux, typescript, GraphQL and GatsbyJS on the front end._\n\n*Job 2*\n\nAny *Senior JavaScript Developers* who want to get away from the buzz of the city centre and live a quieter life give me a shout!\n\nThe role is based in South Manchester and is *offering 2 days remote!*\n\n*Core hours are 10am - 2pm*\n\n*You will be allowed to spend 1 day a month doing R&amp;D!* \n\nThe role will be working on bringing a white label product to market as well as working with some of the newest and fastest growing financial services companies in the UK.\nThis company is number 1 in their field, within the financial services space.\nYou will also be working closely with the designers and the development team in a DevOps environment\n\nRequirements are: -\n• *React*\n• *Node* \nBut also if you have experience in: -\n• *AWS*\n• *GraphQL*\n• *Lambda*\n*Salary is up to £60,000*\n\n*Job 3*\n*I am looking for 2 Senior FE developers to join a company that are privately backed by a FTSE 250 Company based in Manchester* \n\n*They are a start up based in an enterprise and have a very strong DevOps Culture working in a squad based format, and you will be working on your vertical slice on the cake along with the UX Designer, Data Scientist, Team Lead, BE Developer and Product Owners.*\n\n*They are also offering training on the job within their tech stack and want developers who can work autonomously and have a forward thinking mind-set.*\n\n*They are always keen to hear new ideas and ways of working and are open to changing the technical strategy with new and emerging tools, languages etc*\n\n*Their core hours are 10-4 and their is WFH option if needed (as they arent monsters)*\n\n*The must haves are:*\n• *React*\n• *Redux*\n• *Typescript*\n*But if you have: -*\n• *React Hooks*\n• *GraphQL*\n• *GatsbyJS*\n• *Jest*\n• *Jasmine*\nThese would be a bonus!\n\n*They are offering up to £65,000 with a 10% bonus*\n\nSorry for this, but I wanted to share these with the community!\n\nHMU for deets! :raised_hands:",
    "label": ""
  },
  {
    "text": "90% of anything is junk, linkedin included, but it can be useful. I got hired at a dev job in williamsburg through linkedin",
    "label": ""
  },
  {
    "text": "There are also some fantastic \"math for take developers\" videos on YouTube. Literally search for that and there's a bunch.",
    "label": ""
  },
  {
    "text": "But ultimately, I'm looking to get good at computer science to be a good software engineer.",
    "label": ""
  },
  {
    "text": "Hi, dear developers! I wanted to tell you about one position in Finland. Our client is a technology company building an app for food delivery. Be it discovering or getting great meals – takeaway, home delivery or to the table – the company takes care of it. The customers can pick a restaurant, build an order, choose delivery, takeaway or eat in and hit send. The company was founded in 2014 with HQ is in Helsinki, but already has offices in over 15 countries and around 500 employees.\n\nRight now, the Consumer Services Team is looking for an experienced Python Developer to join their team in Helsinki. The team makes sure the company always offers the best customer experience and evolves its core customer interfaces to the next level. Stack: Python, Flask, MongoDB, PostgreSQL.  This is a  good time to join the team, as you'll be part of the troops making this change possible. Besides, they offers an amazing atmosphere, competitive salary, stock options, company discounts and other benefits.\n\nWould you like to meet the team?\n\nI'm ready to answer all of your questions here or via email <mailto:kseniya.fech@toughbyte.com|kseniya.fech@toughbyte.com> or any other suitable way.\n\nThank you for your attention!",
    "label": ""
  },
  {
    "text": "Have a look at this: <https://matthewpalmer.net/kubernetes-app-developer/articles/ultimate-configmap-guide-kubernetes.html>",
    "label": ""
  },
  {
    "text": "Hi everyone, I am currently working as a qa engineer for 4 years . Looking forward to any collaboration to sharpen my dev skills",
    "label": ""
  },
  {
    "text": "wow i cant believe that your implementing in python can you share that link for implementation, i too searching for development of bots in python is this rasa your using?",
    "label": ""
  },
  {
    "text": "I gave it a try the past week on one of my devices. It lacks a solid search tool, but I did find some things about it somewhat useful.  I'm not sold enough to keep using it. But I do like some of the insight it provides",
    "label": ""
  },
  {
    "text": "<https://www.freecodecamp.org/news/computer-programming-skills-2020-survey-developers-hiring-managers-hackerrank/>",
    "label": ""
  },
  {
    "text": "Hello impact makers!\nI'm Aditya, originally from India but have been traveling around the world for almost a year. Currently in Vietnam, SE Asia. I have kind of taken a detour from the corporate ladder (bigger brands -&gt; more salaries -&gt; promotions) to focus more on real impact and things that matter (climate change being one). and of late I have been working with startups in this space. Before this, I have worked as a product manager and entrepreneur for over 4 years mostly in the travel and e-commerce industry, having worked on pretty much the entire product management spectrum. I have a formal education in Mechanical Engineering, Operations Research and Business Administration (all over the place, yaay!). Outside of travelling, I love reading, motorbikes (track racing/touring), cooking and doing headstands\nThere are infinite possibilities out there. Here to interact and collaborate to make the most of such possibilities :)",
    "label": ""
  },
  {
    "text": "Was hired to do QA, ended up doing Devops and Management",
    "label": ""
  },
  {
    "text": "Company: LEX\nRole: UI/UX designer\nFull-time: Yes\nRemote OK: No\nSponsorship: No\nContact: <mailto:pann@lex-markets.com|pann@lex-markets.com>\nLocation: NY\nRelocation Assistance: No\nBrief Description: <https://www.linkedin.com/jobs/view/ui-ux-designer-at-lex-1699413637|https://www.linkedin.com/jobs/view/ui-ux-designer-at-lex-1699413637> About the Role:\nLEX is seeking to hire a UI/UX designer to help us make a beautiful iOS app, website and advertising assets.\n\nYou’ll:\n- Design screens for our iOS app and website\n- Work with our head of Growth to envision and design assets for ads\n- Own and build user facing features end-to-end\n- Work with engineers to bring your designs to life\n- Over time, hire a team of designers to support your work.\n\nRequirements:\n- 3+ years of UI/UX experience\n- Strong passion for UX and Product in addition to pure UI\n- Master of XD, Sketch or comparable tool \n- Proficient at generating animated assets\n- Similar experience as an early employee at a startup would be a bonus\n",
    "label": ""
  },
  {
    "text": "Hello! I wanted to reach out to see if anybody in the group might be interested in a healthcare (pharmacy) idea I've been working on for a couple years that I think would be a big step in the right direction for healthcare. I currently work as an informatics pharmacist for UC Health, where I spend a lot of time working with Epic EMR and integration with other pharmacy systems. I am very familiar with the software on the implementation side, but don’t have a background in development and am looking for someone who could take the lead in that area. This idea would also involve hardware, although somewhat later down the line. Let me know if you might be interested, and feel free to share this with any other groups you are involved in.",
    "label": ""
  },
  {
    "text": "Hey folks :wave: \n\nPosting again about looking for some Senior Node Devs in Melbourne. Focus is on back end but a little bit of Vue front end. Client has a B2B payment gateway solution which is used by some pretty big players out there. It’s proper software engineering :blush::ok_hand: Small-ish team but with international reach. Salary is around $120-130k + super. I’ve got a PD I can share if you’re interested. \n\nAlso an opportunity for a contractor who is still very hands on but keen to mentor/guide the other devs when it comes to technical design and making them better devs. One of the key areas they want experience in is Typescript. Initial 6 month contract up to $900 inc super per day. \n\nThese roles are onsite in Melbourne CBD, so no remote and no sponsorship either. \n\nHit me up if you’d like to have a chat :blush::pray:",
    "label": ""
  },
  {
    "text": "Hiya folks! I'm hiring a contract Python dev who knows AWS/boto3 to help my company build better internal tooling on AWS cost management. This is *not* a full-time role. Freelancers/moonlighters welcome. We're fully remote.\n\nCompany: <https://www.duckbillgroup.com>\n\nDM me if you're interested, or you can email at <mailto:mike@duckbillgroup.com|mike@duckbillgroup.com>.",
    "label": ""
  },
  {
    "text": "Hello all :wave:\n\n*Rome2rio* is hiring in a bunch of different roles! Software Engineers (read as full-stack), Data Scientist Software Engineer, Data Analyst, SEM Manager, Android Developer and Ad Ops.\n*What is the product?* Rome2rio searches any city, town, landmark, attraction or address across the globe with thousands of multi-modal routes to easily get you from A to B.\n*What is the stack?* C# backend and we're moving towards a React frontend (currently jQuery but rebuild in React/TS is happening now and any new projects are React/TS).\n*What is the company like?* Consisting of around 40 people, the team is actually amazing. Everyone always says this but I've been here for just over a year and this is actually true.\n*Where is the office?* We're based in Richmond (throw a stone from Richmond station and it'll crash through our window) and share a building with Culture Amp.\n*Dem perks?*\n• Five weeks annual leave.\n• A biennial transport fund of $1000 for international transit expenses.\n• Family-friendly flexible working hours in a casual environment e.g. a couple coworkers and myself take long lunches and go climbing a couple times a week then just make up the hours other days. Remote work is being phased in but at the minute I generally will work one day a week/fortnight but each team differs.\n• A biennial travel fund of $2000 for European travel.\n• Competitive maternity and paternity leave benefits.\nIf you're interested please reach out and happy to ask any questions! Link to our Careers page here: <https://www.rome2rio.com/careers/>\n\n:heart:",
    "label": ""
  },
  {
    "text": "Hi everyone! I’m Lee, software engineer working for <http://figure.com|figure.com>, a 2-year old FinTech startup with an engineering hub in Philly. SoFi and Square alum, formerly from SF. Currently building the next generation of compelling financial products.\n\nHappy to connect with anyone here; answer any questions about startups, engineering, blockchain, FinTech, hiring at Figure, etc.",
    "label": ""
  },
  {
    "text": "We do actually have someone remote in Perth, but within another area. Unfortunately the product/engineering gigs aren’t :shrug:",
    "label": ""
  },
  {
    "text": "I'm looking for more animation work! These are some examples from my most recent client, but I've also worked as a contractor for Liquid Development for 2+ years.",
    "label": ""
  },
  {
    "text": "I’m still on the lookout for a Front End Developer to join our growing team at Marketforce. We’re working on a few exciting projects at the moment, and have a lot more coming up!\n\nReact :react:\nExciting Projects :nerd_face:\nGreat Team Mates :tada:\nDog Friendly Office :dog:",
    "label": ""
  },
  {
    "text": "OR if you are looking for something new and challenging in your programming career you could come work at Divvy! Learn some Elixir, work with high amounts of data, work with a great team, get the career growth you are seeking and the pay you are worth. It seems that we are only hiring senior engineers right now but im sure mid will open up sooner rather then later. <https://jobs.lever.co/divvypay/3fa75021-1b47-440c-9982-a42767ca71f3> If you would like a bump to the front on an application just let me know and I can personally referral you in the system. Message me with any questions. One of the best jobs i’ve had.",
    "label": ""
  },
  {
    "text": "Making another plug for Mavenlink! We're growing like crazy right now and currently hiring senior Rails engineers. We have a really unique XP environment and a super rad culture. If you're interested in applying, let me know and I can put you in as a referral!\n<https://www.mavenlink.com/career/1161>",
    "label": ""
  },
  {
    "text": "Does anyone have any apprenticeship or entry level software developer positions available? I am a student at Lambda school and I live in Stone Mountain, Georgia. My LinkedIn is: <http://www.linkedin.com/in/GregoryLJordanSr|www.linkedin.com/in/GregoryLJordanSr> ",
    "label": ""
  },
  {
    "text": "Laybuy - We're looking for Full Stack Devs, TS, React slant, PHP background appreciated, but keen for someone who's not deterred by other langs/frameworks right tool for the right job please DM for details",
    "label": ""
  },
  {
    "text": "At a glance, this looks like a pretty nice solution:  <https://www.addevent.com/add-to-calendar-button>",
    "label": ""
  },
  {
    "text": "Hi All, by way of introduction, I work as an HR manager at a global SaaS start-up. We are looking to re-vamp our career paths - we are going function-by-function starting with career paths for our Sales Development Representatives (SDRs). Is there anyone who would be open to sharing some benchmarking in terms of what career progression for SDRs looks like at your company? Happy to also share our current state and what we are considering. Thank you!",
    "label": ""
  },
  {
    "text": "I attended a bootcamp in the UK, named Makers (formerly known as Makers Academy - <https://en.wikipedia.org/wiki/Makers_Academy>)\n\nIt was great! Everyone in my cohort who was seeking employment as a developer managed to land a job, and they continue to work as developers today.",
    "label": ""
  },
  {
    "text": "Any DevOps people looking for a new gig? Looking for 3+ years experience. PM me",
    "label": ""
  },
  {
    "text": "Hello all. i have two openings for React/Redux front end developers in the Norcross area. Looking for around 3-5 years of experience. 3-6 months in duration, possibly longer. DM me if interested!",
    "label": ""
  },
  {
    "text": "Hey folks - my colleague at Peloton is looking for the first mobile device management-focused engineer on her client platform engineering team in NYC; there’s some pretty cool stuff in her roadmap that this person would be able to work on and influence. Please apply if you’re interested, and feel free to pass to other folks who might be interested: <https://grnh.se/c71673b31|https://grnh.se/c71673b31>",
    "label": ""
  },
  {
    "text": "I work at Mercury, and am happy to answer any questions you might have! I told Veronica she should post here, since we're consistently looking for more Haskell engineers.",
    "label": ""
  },
  {
    "text": "I am building an easy-to-use solution for the complex challenge car owners face. A platform connects supply and demand in the car body repair sector in a completely new and innovative way. I am looking for a talented full-stack Ruby on Rails engineer to be a Co-founder and CTO. I have a technical background but I need someone with a deeper understanding and ability to help grow the company. I am looking for someone with strong Ruby on Rails ability. This is an excellent opportunity for a talented developer with an entrepreneurial side.",
    "label": ""
  },
  {
    "text": "I am building an easy-to-use solution for the complex challenge car owners face. A platform connects supply and demand in the car body repair sector in a completely new and innovative way. I am looking for a talented full-stack Ruby on Rails engineer to be a Co-founder and CTO. I have a technical background but I need someone with a deeper understanding and ability to help grow the company. I am looking for someone with strong Ruby on Rails ability. This is an excellent opportunity for a talented developer with an entrepreneurial side.",
    "label": ""
  },
  {
    "text": "I am building an easy-to-use solution for the complex challenge car owners face. A platform connects supply and demand in the car body repair sector in a completely new and innovative way. I am looking for a talented full-stack Ruby on Rails engineer to be a Co-founder and CTO. I have a technical background but I need someone with a deeper understanding and ability to help grow the company. I am looking for someone with strong Ruby on Rails ability. This is an excellent opportunity for a talented developer with an entrepreneurial side.",
    "label": ""
  },
  {
    "text": "I am building an easy-to-use solution for the complex challenge car owners face. A platform connects supply and demand in the car body repair sector in a completely new and innovative way. I am looking for a talented full-stack Ruby on Rails engineer to be a Co-founder and CTO. I have a technical background but I need someone with a deeper understanding and ability to help grow the company. I am looking for someone with strong Ruby on Rails ability. This is an excellent opportunity for a talented developer with an entrepreneurial side.",
    "label": ""
  },
  {
    "text": "I am building an easy-to-use solution for the complex challenge car owners face. A platform connects supply and demand in the car body repair sector in a completely new and innovative way. I am looking for a talented full-stack Ruby on Rails engineer to be a Co-founder and CTO. I have a technical background but I need someone with a deeper understanding and ability to help grow the company. I am looking for someone with strong Ruby on Rails ability. This is an excellent opportunity for a talented developer with an entrepreneurial side.",
    "label": ""
  },
  {
    "text": "I am building an easy-to-use solution for the complex challenge car owners face. A platform connects supply and demand in the car body repair sector in a completely new and innovative way. I am looking for a talented full-stack Ruby on Rails engineer to be a Co-founder and CTO. I have a technical background but I need someone with a deeper understanding and ability to help grow the company. I am looking for someone with strong Ruby on Rails ability. This is an excellent opportunity for a talented developer with an entrepreneurial side.",
    "label": ""
  },
  {
    "text": "I am building an easy-to-use solution for the complex challenge car owners face. A platform connects supply and demand in the car body repair sector in a completely new and innovative way. I am looking for a talented full-stack Ruby on Rails engineer to be a Co-founder and CTO. I have a technical background but I need someone with a deeper understanding and ability to help grow the company. I am looking for someone with strong Ruby on Rails ability. This is an excellent opportunity for a talented developer with an entrepreneurial side.",
    "label": ""
  },
  {
    "text": "I am building an easy-to-use solution for the complex challenge car owners face. A platform connects supply and demand in the car body repair sector in a completely new and innovative way. I am looking for a talented full-stack Ruby on Rails engineer to be a Co-founder and CTO. I have a technical background but I need someone with a deeper understanding and ability to help grow the company. I am looking for someone with strong Ruby on Rails ability. This is an excellent opportunity for a talented developer with an entrepreneurial side.",
    "label": ""
  },
  {
    "text": "I am building an easy-to-use solution for the complex challenge car owners face. A platform connects supply and demand in the car body repair sector in a completely new and innovative way. I am looking for a talented full-stack Ruby on Rails engineer to be a Co-founder and CTO. I have a technical background but I need someone with a deeper understanding and ability to help grow the company. I am looking for someone with strong Ruby on Rails ability. This is an excellent opportunity for a talented developer with an entrepreneurial side.",
    "label": ""
  },
  {
    "text": "I am building an easy-to-use solution for the complex challenge car owners face. A platform connects supply and demand in the car body repair sector in a completely new and innovative way. I am looking for a talented full-stack Ruby on Rails engineer to be a Co-founder and CTO. I have a technical background but I need someone with a deeper understanding and ability to help grow the company. I am looking for someone with strong Ruby on Rails ability. This is an excellent opportunity for a talented developer with an entrepreneurial side.",
    "label": ""
  },
  {
    "text": "I am building an easy-to-use solution for the complex challenge car owners face. A platform connects supply and demand in the car body repair sector in a completely new and innovative way. I am looking for a talented full-stack Ruby on Rails engineer to be a Co-founder and CTO. I have a technical background but I need someone with a deeper understanding and ability to help grow the company. I am looking for someone with strong Ruby on Rails ability. This is an excellent opportunity for a talented developer with an entrepreneurial side.",
    "label": ""
  },
  {
    "text": "I am building an easy-to-use solution for the complex challenge car owners face. A platform connects supply and demand in the car body repair sector in a completely new and innovative way(some call it \"Uber for auto repair\". I am looking for a talented full-stack Ruby on Rails engineer to be a Co-founder and CTO. I have a technical background but I need someone with a deeper understanding and ability to help grow the company. I am looking for someone with strong Ruby on Rails ability. This is an excellent opportunity for a talented developer with an entrepreneurial side.",
    "label": ""
  },
  {
    "text": "I am building an easy-to-use solution for the complex challenge car owners face. A platform connects supply and demand in the car body repair sector in a completely new and innovative way(some call it \"Uber for auto repair\". I am looking for a talented full-stack Ruby on Rails engineer to be a Co-founder and CTO. I have a technical background but I need someone with a deeper understanding and ability to help grow the company. I am looking for someone with strong Ruby on Rails ability. This is an excellent opportunity for a talented developer with an entrepreneurial side.",
    "label": ""
  },
  {
    "text": "Hi Everyone,\n\nWe have a few openings for Backend (Java/Spring) and Frontend (JS/Angluar/NodeJS/React/Vue) Engineers at my company. We are an InsurTech in Chicago IL, we do some pretty cool stuff and this could an exciting opportunity. PM if you’re interested and would like to learn more.\n\nThanks!",
    "label": ""
  },
  {
    "text": "Hi Everyone,\n\nWe have a few openings for Backend (Java/Spring) and Frontend (JS/Angluar/NodeJS/React/Vue) Engineers at my company. We are an InsurTech in Chicago IL, we do some pretty cool stuff and this could an exciting opportunity. PM if you’re interested and would like to learn more.\n\nThanks!",
    "label": ""
  },
  {
    "text": "We're sometimes looking for freelancers to work with at Planet Argon (Portland, OR-based) <https://hi.planetargon.com/freelance-web-developers-contact>",
    "label": ""
  },
  {
    "text": "Hello Everyone! Numerator is hiring Deep Learning Engineers and Data Scientists to join our growing R&amp;D team in Chicago. This is a unique opportunity where you will get a chance to work with an established and rapidly evolving platforms that handles millions of requests and massive amounts of events, and other data. Interested to learn more about the positions feel free to DM or email me at <mailto:alix.balevi@numerator.com|alix.balevi@numerator.com>. You can find more about the roles here:\nDeep Learning Engineer - <https://hrbrg.co/1bocr5>\nData Scientist - <https://hrbrg.co/4w4nm6>\n\nwe do have other roles in the company for those interested :grinning:, which can be found here - <https://www.numerator.com/join-our-team>\n\nAlso learn more about our amazing Head of Data Science Alex in his Engineering blog on \"Impostor Free Zone: Data Science at Numerator\" - <https://www.numeratorengineering.com/impostor-free-zone-data-science-at-numerator/>",
    "label": ""
  },
  {
    "text": "Hey VanDev'ers. I am looking for some infosec assistance. Specifically we are looking to provide SaaS solution to the government, and... being the government - there is a ton of certifications and legalese to wade through. Is anyone aware of any Vancouver (or Victoria) businesses that help companies achieve these types of certs/audits?",
    "label": ""
  },
  {
    "text": "I am partnering with a client looking for someone to be an Front-End SME and help a local client modernize one of their products. They are looking for someone with the ability to come in and take a consultative approach, help with architecture, and development with the latest Angular (Version :sunglasses:.\n* Lead/Senior UI Engineer\n* $65-75/hr (flexible on rate)\n* Brookfield, WI\n* Greenfield Development/ SaaS /Component Libraries\n* Know someone that can do this? I can offer a referral bonus :money_bath:",
    "label": ""
  },
  {
    "text": "I passed this listing along to a few folks involved with <http://elixirschool.com|elixirschool.com> who are looking and they've already abandoned the application because the quiz seems entirely geared towards DevOps with little to do with Elixir. You may want to clarify the position a bit more or revisit your quiz.",
    "label": ""
  },
  {
    "text": "Hey Y’all! This saturday, 757ColorCoded will be giving a special look at Kanban and Agile practice. Learn the skills that every team needs to be productive and ship great products. Share with folks who are looking to get into development or come share your success stories and experiences. <https://www.meetup.com/757ColorCoded/events/khgqmrybcdbdc/>",
    "label": ""
  },
  {
    "text": "Hello all, HOMEE is looking for a React-Native Mobile Application Developer here in lovely OTR.  Click below to learn more about our exciting team and email me at <mailto:pete.johnston@homee.com|pete.johnston@homee.com> to start a conversation.  <https://stackoverflow.com/jobs/218014/react-native-mobile-developer-homee>",
    "label": ""
  },
  {
    "text": "Interested in transforming regulation-tech with Clojure? Droit is hiring a Clojure Developer in both their London &amp; NYC offices! Droit is using Clojure and Clojurescript to automate complex legal and real-time decision systems.\nDroit is a technology firm based in New York City.:chart_with_upwards_trend::computer:\nWith plans to grow the number of developers in New York, they are open to a range of experience levels and functional programming skills, especially Clojure. Droit offers competitive salaries, full benefits, flexible working, and a yearly bonus. Interested in learning more? Email or DM me at <mailto:nicole@functionalworks.com|nicole@functionalworks.com>\n<http://bit.ly/2wnuBBp>",
    "label": ""
  },
  {
    "text": "Interested in transforming regulation-tech with Clojure? Droit is hiring a Clojure Developer in both their London &amp; NYC offices! Droit is using Clojure and Clojurescript to automate complex legal and real-time decision systems.\nDroit is a technology firm based in New York City.:chart_with_upwards_trend::computer:\nWith plans to grow the number of developers in New York, they are open to a range of experience levels and functional programming skills, especially Clojure. Droit offers competitive salaries, full benefits, flexible working, and a yearly bonus. Interested in learning more? Email or DM me at <mailto:nicole@functionalworks.com|nicole@functionalworks.com>\n<http://bit.ly/2wnuBBp>",
    "label": ""
  },
  {
    "text": "[onsite][newyork] Interested in transforming regulation-tech with Clojure? Droit is hiring a Clojure Developer in both their London &amp; NYC offices! Droit is using Clojure and Clojurescript to automate complex legal and real-time decision systems.\nDroit is a technology firm based in New York City.:chart_with_upwards_trend::computer:\nWith plans to grow the number of developers in New York, they are open to a range of experience levels and functional programming skills, especially Clojure. Droit offers competitive salaries, full benefits, flexible working, and a yearly bonus. Interested in learning more? Email or DM me at <mailto:nicole@functionalworks.com|nicole@functionalworks.com>\n<http://bit.ly/2wnuBBp>",
    "label": ""
  },
  {
    "text": "[San Francisco, CA, Onsite, Full Time] Startup building eco friendly electric motors is looking for Senior backend Golang/Python engineers.  They are mission driven to reduce our dependence on fossil fuels as they get their motors out into the world.  They are able to hit around $200K depending on your experience.  If you would like to hear more let me know!",
    "label": ""
  },
  {
    "text": "Hi Everyone! Evisort is hiring a Staff Software Engineer to join their growing office in San Mateo! They use Advanced AI for legal documents and are backed by Bill Gates ($20M Series A). They are seeking seasoned engineers to help scale operations, meet clients' demands, and help develop a strong company culture moving into 2020. Their tech stack consists of Python (Django/celery), js (react), deployed on AWS (S3, RDS, ElasticSearch). They are also hiring Senior Front End Engineers. If interested feel free to DM or email me at <mailto:nicole@functionalworks.com|nicole@functionalworks.com>\n<http://bit.ly/2sNMWpw>",
    "label": ""
  },
  {
    "text": "Hi Everyone! Evisort is hiring a Staff Software Engineer to join their growing office in San Mateo! They use Advanced AI for legal documents and are backed by Bill Gates ($20M Series A). They are seeking seasoned engineers to help scale operations, meet clients' demands, and help develop a strong company culture moving into 2020. Their tech stack consists of Python (Django/celery), js (react), deployed on AWS (S3, RDS, ElasticSearch). They are also hiring Senior Front End Engineers. If interested feel free to DM or email me at <mailto:nicole@functionalworks.com|nicole@functionalworks.com>\n<http://bit.ly/2sNMWpw>",
    "label": ""
  },
  {
    "text": "Hi Everyone! Evisort is hiring a Staff Software Engineer to join their growing office in San Mateo! They use Advanced AI for legal documents and are backed by Bill Gates ($20M Series A). They are seeking seasoned engineers to help scale operations, meet clients' demands, and help develop a strong company culture moving into 2020. Their tech stack consists of Python (Django/celery), js (react), deployed on AWS (S3, RDS, ElasticSearch). They are also hiring Senior Front End Engineers. If interested feel free to DM or email me at <mailto:nicole@functionalworks.com|nicole@functionalworks.com>\n<http://bit.ly/2sNMWpw>",
    "label": ""
  },
  {
    "text": "Hi Everyone! Evisort is hiring a Staff Software Engineer to join their growing office in San Mateo! They use Advanced AI for legal documents and are backed by Bill Gates ($20M Series A). They are seeking seasoned engineers to help scale operations, meet clients' demands, and help develop a strong company culture moving into 2020. Their tech stack consists of Python (Django/celery), js (react), deployed on AWS (S3, RDS, ElasticSearch). They are also hiring Senior Front End Engineers. If interested feel free to DM or email me at <mailto:nicole@functionalworks.com|nicole@functionalworks.com>\n<http://bit.ly/2sNMWpw>",
    "label": ""
  },
  {
    "text": "Hi Everyone! Evisort is hiring a Staff Software Engineer to join their growing office in San Mateo! They use Advanced AI for legal documents and are backed by Bill Gates ($20M Series A). They are seeking seasoned engineers to help scale operations, meet clients' demands, and help develop a strong company culture moving into 2020. Their tech stack consists of Python (Django/celery), js (react), deployed on AWS (S3, RDS, ElasticSearch). They are also hiring Senior Front End Engineers. If interested feel free to DM or email me at <mailto:nicole@functionalworks.com|nicole@functionalworks.com>\n<http://bit.ly/2sNMWpw>",
    "label": ""
  },
  {
    "text": "Hi Everyone! Evisort is hiring a Staff Software Engineer to join their growing office in San Mateo! They use Advanced AI for legal documents and are backed by Bill Gates ($20M Series A). They are seeking seasoned engineers to help scale operations, meet clients' demands, and help develop a strong company culture moving into 2020. Their tech stack consists of Python (Django/celery), js (react), deployed on AWS (S3, RDS, ElasticSearch). They are also hiring Senior Front End Engineers. If interested feel free to DM or email me at <mailto:nicole@functionalworks.com|nicole@functionalworks.com>\n<http://bit.ly/2sNMWpw>",
    "label": ""
  },
  {
    "text": "ok friends, here's a question that won't be contentious at all: if you were a skilled developer looking to do freelance development work in popular programming languages (javascript, ruby, python, etc), what would you charge as your hourly rate?",
    "label": ""
  },
  {
    "text": "PagerDuty is looking for a senior systems engineer.  We have a new space at Ponce City Market and a world class IT team that you would join.  Reach out to me for more details or feel free to apply below.",
    "label": ""
  },
  {
    "text": "I have a user story where a user want to invite a friend to join our platform, but would prefer to search their native contact app to find the contact to insert it in our invitation form. Right now we are just using a mobile responsive web app, and not building native apps yet.\n\nHas anyone developed a solution for giving a web app access to mobile device contacts? Or know of one that we could look at?",
    "label": ""
  },
  {
    "text": "looking at that list i dont see any warehouse people, looks like most, if not all, engineers of some kind",
    "label": ""
  },
  {
    "text": "```Leadership opportunity at Facebook\n\nHi Mike, \n\nHappy Thursday! I believe some of my peers may have contacted you in the past about roles at Facebook. However, I wanted to reach out because it looks like you could be a good fit for leadership opportunities in our Production Engineering organization. I was impressed with your DevOps leadership experience at UrtheCast.\n\nOur PE team is responsible for our infrastructure by helping us scale, improving reliability and ultimately making sure Facebook remains highly available for billions of users across products like Instagram, WhatsApp, Messenger, Oculus and Facebook itself to name a few. We are currently hiring for our Menlo Park, Seattle, NYC, and Boston locations. \n\nDo you have a few minutes to chat in the coming weeks? Looking forward to connecting.\n\nCheers,\n\n Robert Barnes```",
    "label": ""
  },
  {
    "text": "Hi there how are you? hope everyone in here is doing fine!!! I am a recruiter and at this moment have an open position REMOTE - US BASED for a Senior Engineer Python, Ruby, Javascript!",
    "label": ""
  },
  {
    "text": "Hello everyone! I’m looking to speed-hire a Sr Mobile Engineer by the end of the month to help me build &amp; develop Idelic’s mobile app &amp; team. This would be our first mobile specific hire so it’s a great opportunity to decide framework, tooling, and then have the autonomy to build it out. Please slack me directly if you are interested, and I’ll personally respond to you! Here’s the job posting just incase <https://idelic.applytojob.com/apply/eVcTwckzPR/Senior-Software-Engineer-Mobile-Team>",
    "label": ""
  },
  {
    "text": "Morning Gophers! Route is looking for dozens of Go engineers right now in Utah. Here's the link if you're interested. <https://route.com/careers/#software-engineer-backend> . I'm trying to hire at least four more mid level engineers for the package tracking team very quickly so if you message me directly I'm happy to provide more info for what we do on that team and why I think Route is an awesome company to work for.",
    "label": ""
  },
  {
    "text": "Good afternoon folks! ZoomInfo are hiring Infrastructure cloud engineers as part of the IDO (InfraTech and DevOps) organization! We are looking for all levels up to and including a lead Infrastructure cloud based engineer.\n\n<https://www.zoominfo.com/business/about/careers>\n\n• Lead Infrastructure Engineer \n• Senior Infrastructure Engineer \n• Infrastructure Engineer \n• Senior Machine learning Infra Engineer\n• Machine learning Infra Engineer\nSalary ranges are $150 - $160k for Senior. $160k - $170k for Lead.\nPlease feel free to DM me on any of the roles above especially if you want to talk about the minimal job requirements. We really would love to talk to those who are motivated to learn!",
    "label": ""
  },
  {
    "text": "I think I’ve got you all beat… I was hired as a graphic designer and I wound up doing the work of a DBA",
    "label": ""
  },
  {
    "text": "You can try looking into this code lab to see how coroutines can be used with `Room` and `ViewModel`- <https://codelabs.developers.google.com/codelabs/kotlin-coroutines/#2>",
    "label": ""
  },
  {
    "text": "My first pro Rails dev job was after Rackspace hired me in as a sysadmin for a product that wasn't in my wheelhouse, so they transferred me into an open Rails Dev req they'd had unfilled for a while",
    "label": ""
  },
  {
    "text": "have also been hired as a marketing developer and ended up as an app developer",
    "label": ""
  },
  {
    "text": "I got hired as a cloud architect for QA infrastructure, ended up doing serverless development for a chat bot  ML platform team.",
    "label": ""
  },
  {
    "text": "Hi, any Laravel developers with a decent amount of experience looking for a new role? Experience with Vue a benefit too. Full time. We are a SaaS company based in Leighton Buzzard, UK. We offer 2 days remote per week remote working, private healthcare, great working environment. Must be able to be in the office 3 days p/week. Thanks!",
    "label": ""
  },
  {
    "text": "<@UGXLC642W> We are only looking for a full time developer.",
    "label": ""
  },
  {
    "text": "Hey guys -- One of my financial customers is looking for a senior react developer. This is an approved multi-year contract, but looking to bring this person on permanent sometime within that. You'd be working on one of most visible projects, doing a digital transformation using React. Let me know if you or anyone you know would like to hear more details :slightly_smiling_face:",
    "label": ""
  },
  {
    "text": "****NO sponsorship at this time****\n* *\n*Why you want to work here!*\n·        *Opportunity:* There is room to grow\n·        *Brand:* With this company on your resume, doors open!\n·        *Autonomy:* Less micromanagement and red tape!\n·        *Technology:* Bleeding edge technology, nearly unlimited R&amp;D budget\n·        *Office Space:* The view is incredible, state of the art test lab\n* *\n*Position:* Principal Android Developer / Core Android Engineer / Android Mobile Developer\n*Client:* Confidential\n*Location:* Denver, CO (DTC)\n*Type:* Direct Hire\n*Salary target:* Up to 160K for a total BOSS, also open to bonus/relocation package\n\n*What they’re looking for:* Someone who really understands the internals Android, what some refer to as Android Core Development. Familiarity with how a UI-less app works and the permissions needed.\n·        Threading: Executors, Handlers, AsyncTask, Threads, Loader, etc.\n·        Experience with SDK and responding/resolving ANR\n·        Services: Intent, Foreground, Threading, Job Scheduler\n·        Processes: Application object (they run on a single process)\n·        Play store experience: what types of things can you do with it?\n·        Reflection, hidden methods, etc: NoSuchMethodException, blacklisted, greylisted accesses\n·        Firebase: Crashlytics, FCM\n·        Builds and CI: Gradle scripts, Artifactory, Code Coverage\n\n*Required Qualifications:*\n·        6+ years of overall application development experience\n·        4+ years of Android application engineering experience\n·        Experience with creating the UI-less background application\n·        Multithreading\n·        ADB (Android Debug Bridge) troubleshooting\n* *\n*Preferred Qualifications:*\n·        7+ years of Android application development experience\n·        10+ years of overall application development experience\n·        3+ years of web services development experience using REST, JSON, XML",
    "label": ""
  },
  {
    "text": "Principal Android Devs! Just requalified with hiring manager after my latest interviewee! Denver, CO Fortune 500 in Telecom: State of the art test lab, bleeding edge tech, great view, autonomy, opportunity for advancement, good pay. See thread for more details and updated JD. Please DM me on Slack if interested.",
    "label": ""
  },
  {
    "text": "****NO sponsorship at this time****\n* *\n*Why you want to work here!*\n·        *Opportunity:* There is room to grow\n·        *Brand:* With this company on your resume, doors open!\n·        *Autonomy:* Less micromanagement and red tape!\n·        *Technology:* Bleeding edge technology, nearly unlimited R&amp;D budget\n·        *Office Space:* The view is incredible, state of the art test lab\n* *\n*Position:* Principal Android Developer / Core Android Engineer / Android Mobile Developer\n*Client:* Confidential\n*Location:* Denver, CO (DTC)\n*Type:* Direct Hire\n*Salary target:* Up to 160K for a total BOSS, also open to bonus/relocation package\n\n*What they’re looking for:* Someone who really understands the internals Android, what some refer to as Android Core Development. Familiarity with how a UI-less app works and the permissions needed.\n·        Threading: Executors, Handlers, AsyncTask, Threads, Loader, etc.\n·        Experience with SDK and responding/resolving ANR\n·        Services: Intent, Foreground, Threading, Job Scheduler\n·        Processes: Application object (they run on a single process)\n·        Play store experience: what types of things can you do with it?\n·        Reflection, hidden methods, etc: NoSuchMethodException, blacklisted, greylisted accesses\n·        Firebase: Crashlytics, FCM\n·        Builds and CI: Gradle scripts, Artifactory, Code Coverage\n\n*Required Qualifications:*\n·        6+ years of overall application development experience\n·        4+ years of Android application engineering experience\n·        Experience with creating the UI-less background application\n·        Multithreading\n·        ADB (Android Debug Bridge) troubleshooting\n* *\n*Preferred Qualifications:*\n·        7+ years of Android application development experience\n·        10+ years of overall application development experience\n·        3+ years of web services development experience using REST, JSON, XML",
    "label": ""
  },
  {
    "text": "Happy Hump Day everyone!  EAGLE6 is currently looking for an experienced UI/UX Designer to join our great team!  Ideally we are looking for 3+ years of UI/UX design experience, as well as someone that lives, breathes, and dreams about innovative design work.  Feel free to DM or email me for more info!  <mailto:dsmith@riveragroup.com|dsmith@riveragroup.com>\n\n<http://eagle6.hrmdirect.com/employment/job-opening.php?req=1228691&amp;&amp;cust_sort1=101075&amp;#job>",
    "label": ""
  },
  {
    "text": "I wouldn't worry too much about specialisation. I just started a game dev role, and my past experience was in Web development and research into advanced scheduling algorithms.",
    "label": ""
  },
  {
    "text": "*We are currently looking for a contract Solutions Architect with UI/UX experience in the IoT space for a long term contract. Please DM for more info. Position: IoT Solutions Architect-UI/UX Developer*\n*Duration: 12 Months*\n*Location: Plano, TX*\n*Position Description:*\nOur client, a global leader in the deployment of leading edge IoT solutions for commercial enterprise applications is seeking an IoT Software Solutions Architect with previous experience in IoT applications and UI/UX Development experience to join a dynamic team of IoT industry leaders in the architecture, design and implementation of next generation IoT solutions.  The ideal candidate will combine advanced knowledge and experience in IoT Solutions Architecture, UI/UX Development, as well as knowledge of IoT devices, ecosystems and cloud infrastructure; and with experience in a customer facing, consultative selling environment. Additionally, the ideal candidate will have the ability to understand both the client’s business and technical environment and apply that understanding to IoT solution and proof of concept development. Ideally, we are looking for candidates who have experience doing billable consulting.",
    "label": ""
  },
  {
    "text": "*Position: IoT Solutions Architect-UI/UX Developer*\n*Duration: 12 Months*\n*Location: Plano, TX*\n*Position Description:*\nOur client, a global leader in the deployment of leading edge IoT solutions for commercial enterprise applications is seeking an IoT Software Solutions Architect with previous experience in IoT applications and UI/UX Development experience to join a dynamic team of IoT industry leaders in the architecture, design and implementation of next generation IoT solutions.  The ideal candidate will combine advanced knowledge and experience in IoT Solutions Architecture, UI/UX Development, as well as knowledge of IoT devices, ecosystems and cloud infrastructure; and with experience in a customer facing, consultative selling environment. Additionally, the ideal candidate will have the ability to understand both the client’s business and technical environment and apply that understanding to IoT solution and proof of concept development. Ideally, we are looking for candidates who have experience doing billable consulting.",
    "label": ""
  },
  {
    "text": "Oh, yes I was. Sorry, I was only looking at the official release. For the dev image I created,\n```$ go version\ngo version go1.12.6 darwin/amd64```\nThink it’s worth building the dev image again with that netdns setting? The goal is to get the official release working, but I suppose if I created a dev image with that setting and it _didn’t_ work, that might indicate that that’s how the official release was compiled.",
    "label": ""
  },
  {
    "text": "Hi, All! Sales engineer in Denver at Fruition. Just checking things out. We’re an open-source shop, mostly working on Drupal &amp; WP. I have a background in design and front-end development, and always looking to keep the skills fresh.",
    "label": ""
  },
  {
    "text": "So as our infra bottom feeders get put into the blender of devs, we will be loosing out git hub enterprise, and moving to git soma...haven't looked at it yet but there was... opposition",
    "label": ""
  },
  {
    "text": "My view stands by the idea that experimentation may hold us up short-term, but staying on your current path will only hold you up longterm. Experimentation could be anything from using new tools, new development styles, and new product refinement strategies. I'm not sure if this is exactly what you are looking for, but I think you have to consider what is worthy of being overhead now to eliminate or mitigate overhead later down the road",
    "label": ""
  },
  {
    "text": "*About Us*\n\nAt Stateless we are building something special. Not just in terms of a disruptive technology but also in terms of culture. A culture were people authentically personify our organizational values. Supportive. Sincere. Studious. Striving. Stateless.\n\nStateless is on a mission to reinvent network connectivity. Central to that was our initial innovation, where we demonstrated an ability to efficiently decouple state from processing in network functions—a task deemed infeasible in high-performance networking systems, but in doing so, we have opened the door for fundamentally changing how networks are built. Now, we are building the product around that vision. VCs have backed us, and early adopters have validated the business opportunity.\n\nWe are hiring for a variety of roles: from C++, Python, and Kotlin developers to DevOps, sales and support engineers.",
    "label": ""
  },
  {
    "text": "(I’m looking at you, devs, that disable puppet on Linux systems, or remove the execute bit on the jamf binary)",
    "label": ""
  },
  {
    "text": "This is the first year of our internship program, so I can't make firm promises about things that have not been tested yet. What I can tell you is that it will be a paid summer internship, the compensation is intended to be competitive with the top tech companies, and we are interested in hiring from the internship program for full-time roles. I would certainly hope that the engineering interns will be able to contribute to production projects, although the one non-technical intern whom we have recruited will be working on an internal project.",
    "label": ""
  },
  {
    "text": "Hi Shaun. If you are looking for a part time coding/game development opportunity, teaching kids how to code, please reach out to me! Thanks!!",
    "label": ""
  },
  {
    "text": "Hi Noah. If you are looking for a part time role that involves coding, game development, working with kids, please reach out to me. Thanks! ",
    "label": ""
  },
  {
    "text": "<@U042AMNCN> We are currently hiring experienced developers and interns. But it is also helpful to meet entry-level people, because they may consider us later in their career or we might have entry-level positions available at a later date.",
    "label": ""
  },
  {
    "text": "Good morning. I'm the COO of Galileo Tech Media, and SEO firm with remote workers all over (including CHS). We are looking to add a Technical SEO Specialist to our team on a project-basis. (We're keeping our current specialist busy, so need to add a 2nd!) Looking for someone proficient in technical SEO audits, keyword research, Schema, local SEO, etc. Experience with BrightEdge technology also a plus. All work is remote.",
    "label": ""
  },
  {
    "text": "Hi Team! We are looking for a Senior Platform Engineer to join our Aspire family. Kindly find the JD as below\n\n<https://www.linkedin.com/jobs/view/1166450961/?alternateChannel=search>\n\n*Job Location*:- Bangalore, Karnataka, India\n\nKindly feel free to send your resume at <mailto:suvankar.chakraborty@thermeon.com|suvankar.chakraborty@thermeon.com>\n\nThanks,\nSuvankar",
    "label": ""
  },
  {
    "text": "well it’s not even a caliber of engineer, it’s a team of engineers, smaller shops don’t have the luxury sometimes of having more than 1 person doing the role they are hired for",
    "label": ""
  },
  {
    "text": "Good afternoon, folks! :wave:\n\nAre you looking for an ultra-sharp, fast and reasonable-priced designer-duo? :art: :sparkles:\nI’m currently transitioning into doing more freelance gigs together with my fellow creative partner!\n\nWe are experienced within these areas:\n:point_right::skin-tone-2:  *Concept Development*\n:point_right::skin-tone-3:  *UI &amp; UX Design*\n:point_right::skin-tone-4:  *Visual Identity &amp; Branding*\n:point_right::skin-tone-5:  *Animation and Video-editing*\n:point_right::skin-tone-6:  *Social Media &amp; Marketing Strategy*\n\nAs you can see we are quite multidiciplinary - which comes from years of making our own digital projects, bringing them to market and having worked for some years in the “agency-world”.\n\n:love_letter:  Don’t hesitate to send a DM for examples of work!\n:moneybag:  We do both project-based pricing and hourly rates, depending on the type of project.\n:flag-dk:  Danish but currently based in Sweden. (We are level 100+ in doing Hangout’s).\n\nKindly, Daniel Bech &amp; Casper Nielsen",
    "label": ""
  },
  {
    "text": "Good morning. I'm the COO of Galileo Tech Media, and SEO firm with remote workers all over (including CHS). We are looking to add a Technical SEO Specialist to our team on a project-basis. (We're keeping our current resource busy, so need to add a 2nd!) Looking for someone proficient in technical SEO audits, keyword research, Schema, local SEO, etc. Experience with BrightEdge technology also a plus. All work is remote.",
    "label": ""
  },
  {
    "text": "Open the dev tools &gt; network. Make any request within the dashboard. Look into the request header and copy the Authorization header.\n\nNow use that header in your graphql query and try to make the request that you want to make. Maybe that could work.",
    "label": ""
  },
  {
    "text": "Looking for experience UX Designers with strong user research abilities in the Denver/Boulder area.  PM me or apply here:  <https://careers.trimble.com/jobs/general-business/westminster-co-us/senior-ux-designer/P_AAAAAAEAAIzF9vJieahagj?lang=en_us#/>",
    "label": ""
  },
  {
    "text": "Hey Everyone! We are getting ready to open a Code Ninjas Center in the Charlotte area and looking for part time staff that are passionate about coding, game development, gaming in general, love working with children! If you are looking for a part time opportunity or know anyone that may be interested, please let me know!! Looking forward to being a part of this group and learning :smiley:",
    "label": ""
  },
  {
    "text": "Has anybody used Azure devops pipelines for automated titanium builds? Just looking to hear the experiences",
    "label": ""
  },
  {
    "text": "Hi everyone, I’ve been working on my startup business and  currently in the process of development. I’m looking for someone who specializes in backend programming. ",
    "label": ""
  },
  {
    "text": "Running Kafka on cloud disks is no fun (IO Limits), lots of things to be aware of and very necessary to reattached them on rolling brokers to avoid saturating the network. there's a load of funkiness with using dynamic IPs and clients caching them forever I think since &gt;= 2.1.0 they are mostly resolved.\n\nI should be running kafka but I'm a single devops person for our team and having such a critical component just under me isn't ideal, so we use <https://www.confluent.io/confluent-cloud/> its usage based pricing. Its grand for now, won't be cost effective as traffic increases but when that happens we can hire more people.\n\nRunning zookeeper is not ideal but its going away <https://cwiki.apache.org/confluence/display/KAFKA/KIP-500%3A+Replace+ZooKeeper+with+a+Self-Managed+Metadata+Quorum>\n\nAWS have a managed kafka service too but confluent are the experts.",
    "label": ""
  },
  {
    "text": "I think it could save you in the long run to look at things like <https://developer.mozilla.org/en-US/docs/Web/CSS/flex>\nor <https://css-tricks.com/snippets/css/complete-guide-grid/>\nand maybe <https://developer.mozilla.org/en-US/docs/Web/CSS/object-fit> for the images",
    "label": ""
  },
  {
    "text": "Hello! I'm trying to develop an app that integrates our cloud system with slack and I'm having trouble with the token part of V2 OAuth 2.0 flow. Every tutorial I find says to look up the bot token in App Home - and sure enough it works when I do that. The question I have is where do I find bot tokens of other work spaces, because it is said that every work space that installs the app gets a different bot token? However I can't find any mention of where and when you get the bot tokens when installing the bot in other work spaces, only in my own (through the app home panel).\nAlso just wanted to say it's an awesome community you have here, Slack! Happy to be a part of it.",
    "label": ""
  },
  {
    "text": "An invitation from the design team at Fellow:\n\n\"Calling all designers and Figma users! Join us for Figma Ottawa's official kick-off event. Come celebrate with us on March 11th from 6 pm - 8:00 pm. :tada:\n\nRegister Here: <https://bit.ly/2vCWEMJ>\n\nWhether you're a dedicated Figma user or just curious and looking to gather with like-minded designers, this event will have something for everyone. \n \nCome join us for a casual evening to meet the community and get a sneak peek for what's to come. We're looking forward to having more tactical discussions around workflow, developer handoff, design systems, working remote, prototyping, user testing and so much more. Food and drinks will be provided. There may also be a few little surprises along the way.\n \nThis is it Ottawa, let's shake things up and jump-start a well needed new chapter.\"",
    "label": ""
  },
  {
    "text": "not  sure if this is the right channel or <#C0W1X7ZAL|puppet-dev>: Is there a way to _enable_ a disabled cop via `.sync.yml` in PDK? I have tried numerous permutations of the configuration and looking this line:\n```(default_enabled_cops - enabled_cops).sort.each { |c| configs[c] ||= cop_configs[c] || {}; configs[c]['Enabled'] = false }```\nin <https://github.com/puppetlabs/pdk-templates/blob/master/moduleroot/.rubocop.yml.erb>\nit reads: if a cop is in Rubocop’s default enabled list but _not_ in the list for the selected profile - set it to disabled. There is no option to override this afaict. Am i wrong?",
    "label": ""
  },
  {
    "text": "Join us for Figma Ottawa's official kick-off event. Come celebrate with us on March 11th from 6 pm - 8:00 pm. :tada:\n\nRegister Here: <https://bit.ly/2vCWEMJ>\n\nWhether you're a dedicated Figma user or just curious and looking to gather with like-minded designers, this event will have something for everyone. \n \nCome join us for a casual evening to meet the community and get a sneak peek for what's to come. We're looking forward to having more tactical discussions around workflow, developer handoff, design systems, working remote, prototyping, user testing and so much more. Food and drinks will be provided. There may also be a few little surprises along the way.\n \nThis is it Ottawa, let's shake things up and jump-start a well needed new chapter.",
    "label": ""
  },
  {
    "text": "My team at <http://Care.com/HomePay|Care.com/HomePay> is growing fast! We are currently hiring for product manager, recruiter, business development, and systems engineer roles - all at various levels. Please reach out if you’re interested. More opportunities to come!\n\n<https://www.care.com/vis/careers/location/austin-texas?fbclid=IwAR0IqKampTZ1fFrjz_YrFIhAAHt5kIAjQTi8nvQYooe5vg0JaQTf8JZUE5w|https://www.care.com/vis/careers/location/austin-texas?fbclid=IwAR0IqKampTZ1fFrjz_YrFIhAAHt5kIAjQTi8nvQYooe5vg0JaQTf8JZUE5w>",
    "label": ""
  },
  {
    "text": "Hello everyone, I new to programming. Looking to learn web development. HTML and CSS completed and about to start javascript",
    "label": ""
  },
  {
    "text": "<@U2TU2QK9B> we use Outlook for this specific company. I believe one of our engineers tried to use DEP but was rejected by apple. Something about having to be the direct owners of the devices and we only manage them for said company",
    "label": ""
  },
  {
    "text": "There is a built in <https://developer.mozilla.org/en-US/docs/Web/API/URLSearchParams>",
    "label": ""
  },
  {
    "text": "Hi Mila,\n\nIt would basically depend on which mode your organisation is running in i.e. start-up or regularly paced (an established org.)\n\nCandidate 1 will take up loads of time in being mentored not only in design guidelines aspect but even learning industry norms such as following brand guidelines. Here you'll need to invest your time on regular basis and can expect surprises along the way.\n\nCandidate 2, will generally understand your expectations and will try and deliver within the scope outlined by you. The work may not spring many surprises and will be completed within set timeline.\n\nAlso, you'll need to align these candidates with senior designer you are hiring down the line.\n\nHope this helps in decision making process.\n\nBest",
    "label": ""
  },
  {
    "text": "`DISYS is looking for an Architecture - Alfresco in Austin, TX 78758 for a 12 + Months Contract Role.`  -- yoohoo!! fuck devops",
    "label": ""
  },
  {
    "text": "Debate on hiring product managers and the evolution of this role. Is it evolving to become a glorified Scrum Master or will it become more of a commercially savvy product leader who has a good appreciation of engineering challenges ?\n\nI see more requests for hands-on PMs all the way upto Director level !",
    "label": ""
  }
]